/* automatically generated by rust-bindgen 0.68.1 */

#[derive(PartialEq, Copy, Clone, Hash, Debug, Default)]
#[repr(C)]
pub struct __BindgenComplex<T> {
    pub re: T,
    pub im: T,
}
pub const _STDIO_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2X: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 1;
pub const __SYSCALL_WORDSIZE: u32 = 64;
pub const __TIMESIZE: u32 = 64;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_SCANF: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_60559_BFP__: u32 = 201404;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_IEC_60559_COMPLEX__: u32 = 201404;
pub const __STDC_ISO_10646__: u32 = 201706;
pub const __GNU_LIBRARY__: u32 = 6;
pub const __GLIBC__: u32 = 2;
pub const __GLIBC_MINOR__: u32 = 35;

pub const GxB_IMPLEMENTATION_DATE: &[u8; 12] = b"Oct 7, 2023\0";
pub const GxB_IMPLEMENTATION_MAJOR: u32 = 9;
pub const GxB_IMPLEMENTATION_MINOR: u32 = 0;
pub const GxB_IMPLEMENTATION_SUB: u32 = 0;
pub const GxB_SPEC_DATE: &[u8; 12] = b"Oct 7, 2023\0";
pub const GxB_SPEC_MAJOR: u32 = 2;
pub const GxB_SPEC_MINOR: u32 = 1;
pub const GxB_SPEC_SUB: u32 = 0;
pub const GRB_VERSION: u32 = 2;
pub const GRB_SUBVERSION: u32 = 1;
pub const GxB_NTHREADS: u32 = 7086;
pub const GxB_CHUNK: u32 = 7087;
pub const GxB_GPU_ID: u32 = 7088;
pub const GxB_MAX_NAME_LEN: u32 = 128;
pub const GxB_HYPERSPARSE: u32 = 1;
pub const GxB_SPARSE: u32 = 2;
pub const GxB_BITMAP: u32 = 4;
pub const GxB_FULL: u32 = 8;
pub const GxB_NBITMAP_SWITCH: u32 = 8;
pub const GxB_ANY_SPARSITY: u32 = 15;
pub const GxB_AUTO_SPARSITY: u32 = 15;
pub const GxB_BEGIN: u32 = 0;
pub const GxB_END: u32 = 1;
pub const GxB_INC: u32 = 2;
pub const GxB_COMPRESSION_NONE: i32 = -1;
pub const GxB_COMPRESSION_DEFAULT: u32 = 0;
pub const GxB_COMPRESSION_LZ4: u32 = 1000;
pub const GxB_COMPRESSION_LZ4HC: u32 = 2000;
pub const GxB_COMPRESSION_ZSTD: u32 = 3000;
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    const UNINIT: ::std::mem::MaybeUninit<__fsid_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: ::std::os::raw::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: ::std::os::raw::c_uint,
    pub __wchb: [::std::os::raw::c_char; 4usize],
}
#[test]
fn bindgen_test_layout___mbstate_t__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<__mbstate_t__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wch) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wch)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wchb) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wchb)
        )
    );
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mbstate_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t>(),
        8usize,
        concat!("Size of: ", stringify!(__mbstate_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__count) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__value) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__value)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos_t() {
    const UNINIT: ::std::mem::MaybeUninit<_G_fpos_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_G_fpos_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_G_fpos_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pos) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__state) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__state)
        )
    );
}
pub type __fpos_t = _G_fpos_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos64_t() {
    const UNINIT: ::std::mem::MaybeUninit<_G_fpos64_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_G_fpos64_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_G_fpos64_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pos) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__state) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__state)
        )
    );
}
pub type __fpos64_t = _G_fpos64_t;
pub type __FILE = _IO_FILE;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_codecvt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_wide_data {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub _codecvt: *mut _IO_codecvt,
    pub _wide_data: *mut _IO_wide_data,
    pub _freeres_list: *mut _IO_FILE,
    pub _freeres_buf: *mut ::std::os::raw::c_void,
    pub __pad5: usize,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[test]
fn bindgen_test_layout__IO_FILE() {
    const UNINIT: ::std::mem::MaybeUninit<_IO_FILE> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_IO_FILE>(),
        216usize,
        concat!("Size of: ", stringify!(_IO_FILE))
    );
    assert_eq!(
        ::std::mem::align_of::<_IO_FILE>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_FILE))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_read_ptr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_ptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_read_end) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_read_base) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_write_base) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_write_ptr) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_ptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_write_end) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_buf_base) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_buf_end) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_save_base) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_backup_base) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_backup_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_save_end) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._markers) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_markers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._chain) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_chain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._fileno) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_fileno)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._flags2) as usize - ptr as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._old_offset) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_old_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._cur_column) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_cur_column)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._vtable_offset) as usize - ptr as usize },
        130usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_vtable_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._shortbuf) as usize - ptr as usize },
        131usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_shortbuf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._lock) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_lock)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._offset) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._codecvt) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_codecvt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wide_data) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_wide_data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._freeres_list) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_list)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._freeres_buf) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_buf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad5) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._mode) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._unused2) as usize - ptr as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_unused2)
        )
    );
}
pub type off_t = __off_t;
pub type fpos_t = __fpos_t;
extern "C" {
    pub static mut stdin: *mut FILE;
}
extern "C" {
    pub static mut stdout: *mut FILE;
}
extern "C" {
    pub static mut stderr: *mut FILE;
}
extern "C" {
    pub fn remove(__filename: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rename(
        __old: *const ::std::os::raw::c_char,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn renameat(
        __oldfd: ::std::os::raw::c_int,
        __old: *const ::std::os::raw::c_char,
        __newfd: ::std::os::raw::c_int,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tmpnam_r(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tempnam(
        __dir: *const ::std::os::raw::c_char,
        __pfx: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fflush(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn freopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
        __stream: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fdopen(__fd: ::std::os::raw::c_int, __modes: *const ::std::os::raw::c_char)
        -> *mut FILE;
}
extern "C" {
    pub fn fmemopen(
        __s: *mut ::std::os::raw::c_void,
        __len: usize,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn open_memstream(
        __bufloc: *mut *mut ::std::os::raw::c_char,
        __sizeloc: *mut usize,
    ) -> *mut FILE;
}
extern "C" {
    pub fn setbuf(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn setvbuf(
        __stream: *mut FILE,
        __buf: *mut ::std::os::raw::c_char,
        __modes: ::std::os::raw::c_int,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setbuffer(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char, __size: usize);
}
extern "C" {
    pub fn setlinebuf(__stream: *mut FILE);
}
extern "C" {
    pub fn fprintf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn printf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfprintf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vprintf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsnprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vdprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fscanf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn scanf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = u128;
extern "C" {
    #[link_name = "\u{1}__isoc99_fscanf"]
    pub fn fscanf1(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_scanf"]
    pub fn scanf1(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_sscanf"]
    pub fn sscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfscanf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vscanf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vfscanf"]
    pub fn vfscanf1(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vscanf"]
    pub fn vscanf1(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vsscanf"]
    pub fn vsscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar_unlocked(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getw(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putw(__w: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgets(
        __s: *mut ::std::os::raw::c_char,
        __n: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getline(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn fputs(__s: *const ::std::os::raw::c_char, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn puts(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ungetc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fread(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn fwrite(
        __ptr: *const ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __s: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn fread_unlocked(
        __ptr: *mut ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fwrite_unlocked(
        __ptr: *const ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fseek(
        __stream: *mut FILE,
        __off: ::std::os::raw::c_long,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftell(__stream: *mut FILE) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn rewind(__stream: *mut FILE);
}
extern "C" {
    pub fn fseeko(
        __stream: *mut FILE,
        __off: __off_t,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftello(__stream: *mut FILE) -> __off_t;
}
extern "C" {
    pub fn fgetpos(__stream: *mut FILE, __pos: *mut fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fsetpos(__stream: *mut FILE, __pos: *const fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr(__stream: *mut FILE);
}
extern "C" {
    pub fn feof(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr_unlocked(__stream: *mut FILE);
}
extern "C" {
    pub fn feof_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn perror(__s: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn fileno(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fileno_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn popen(
        __command: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn ctermid(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn flockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn ftrylockfile(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn funlockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn __uflow(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __overflow(arg1: *mut FILE, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __errno_location() -> *mut ::std::os::raw::c_int;
}
extern "C" {
    pub fn memcpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memmove(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memccpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memset(
        __s: *mut ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memcmp(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __memcmpeq(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn memchr(
        __s: *const ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn strcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcat(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strncat(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcoll(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strxfrm(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_ulong;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::std::os::raw::c_ushort,
    pub __ctype_tolower: *const ::std::os::raw::c_int,
    pub __ctype_toupper: *const ::std::os::raw::c_int,
    pub __names: [*const ::std::os::raw::c_char; 13usize],
}
#[test]
fn bindgen_test_layout___locale_struct() {
    const UNINIT: ::std::mem::MaybeUninit<__locale_struct> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__locale_struct>(),
        232usize,
        concat!("Size of: ", stringify!(__locale_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<__locale_struct>(),
        8usize,
        concat!("Alignment of ", stringify!(__locale_struct))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__locales) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__locales)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ctype_b) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_b)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ctype_tolower) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_tolower)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ctype_toupper) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_toupper)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__names) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__names)
        )
    );
}
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
extern "C" {
    pub fn strcoll_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __l: locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strxfrm_l(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: usize,
        __l: locale_t,
    ) -> usize;
}
extern "C" {
    pub fn strdup(__s: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strndup(
        __string: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strchr(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strrchr(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcspn(
        __s: *const ::std::os::raw::c_char,
        __reject: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strspn(
        __s: *const ::std::os::raw::c_char,
        __accept: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strpbrk(
        __s: *const ::std::os::raw::c_char,
        __accept: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strstr(
        __haystack: *const ::std::os::raw::c_char,
        __needle: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strtok(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __strtok_r(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
        __save_ptr: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strtok_r(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
        __save_ptr: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strlen(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strnlen(__string: *const ::std::os::raw::c_char, __maxlen: usize) -> usize;
}
extern "C" {
    pub fn strerror(__errnum: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[link_name = "\u{1}__xpg_strerror_r"]
    pub fn strerror_r(
        __errnum: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __buflen: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strerror_l(
        __errnum: ::std::os::raw::c_int,
        __l: locale_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn bcmp(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bcopy(
        __src: *const ::std::os::raw::c_void,
        __dest: *mut ::std::os::raw::c_void,
        __n: usize,
    );
}
extern "C" {
    pub fn bzero(__s: *mut ::std::os::raw::c_void, __n: ::std::os::raw::c_ulong);
}
extern "C" {
    pub fn index(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn rindex(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ffs(__i: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ffsl(__l: ::std::os::raw::c_long) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ffsll(__ll: ::std::os::raw::c_longlong) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcasecmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncasecmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcasecmp_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __loc: locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncasecmp_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: usize,
        __loc: locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn explicit_bzero(__s: *mut ::std::os::raw::c_void, __n: usize);
}
extern "C" {
    pub fn strsep(
        __stringp: *mut *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strsignal(__sig: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __stpcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn stpcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __stpncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn stpncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_div_t() {
    const UNINIT: ::std::mem::MaybeUninit<div_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<div_t>(),
        8usize,
        concat!("Size of: ", stringify!(div_t))
    );
    assert_eq!(
        ::std::mem::align_of::<div_t>(),
        4usize,
        concat!("Alignment of ", stringify!(div_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ldiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_ldiv_t() {
    const UNINIT: ::std::mem::MaybeUninit<ldiv_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(ldiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ldiv_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout_lldiv_t() {
    const UNINIT: ::std::mem::MaybeUninit<lldiv_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<lldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(lldiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<lldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(lldiv_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
extern "C" {
    pub fn __ctype_get_mb_cur_max() -> usize;
}
extern "C" {
    pub fn atof(__nptr: *const ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn atoi(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn atol(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn atoll(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtod(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f64;
}
extern "C" {
    pub fn strtof(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f32;
}
extern "C" {
    pub fn strtold(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> u128;
}
extern "C" {
    pub fn strtol(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn strtoul(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strtoq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtouq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn strtoll(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtoull(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn l64a(__n: ::std::os::raw::c_long) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn a64l(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___sigset_t() {
    const UNINIT: ::std::mem::MaybeUninit<__sigset_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__sigset_t>(),
        128usize,
        concat!("Size of: ", stringify!(__sigset_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__sigset_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__sigset_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sigset_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    const UNINIT: ::std::mem::MaybeUninit<timeval> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<timeval>(),
        16usize,
        concat!("Size of: ", stringify!(timeval))
    );
    assert_eq!(
        ::std::mem::align_of::<timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(timeval))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_usec) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_usec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    const UNINIT: ::std::mem::MaybeUninit<timespec> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::std::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_nsec) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
    const UNINIT: ::std::mem::MaybeUninit<fd_set> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(fd_set))
    );
    assert_eq!(
        ::std::mem::align_of::<fd_set>(),
        8usize,
        concat!("Alignment of ", stringify!(fd_set))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__fds_bits) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fd_set),
            "::",
            stringify!(__fds_bits)
        )
    );
}
pub type fd_mask = __fd_mask;
extern "C" {
    pub fn select(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pselect(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> ::std::os::raw::c_int;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __atomic_wide_counter {
    pub __value64: ::std::os::raw::c_ulonglong,
    pub __value32: __atomic_wide_counter__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __atomic_wide_counter__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___atomic_wide_counter__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<__atomic_wide_counter__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__atomic_wide_counter__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(__atomic_wide_counter__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__atomic_wide_counter__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__atomic_wide_counter__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__low) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__high) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___atomic_wide_counter() {
    const UNINIT: ::std::mem::MaybeUninit<__atomic_wide_counter> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__atomic_wide_counter>(),
        8usize,
        concat!("Size of: ", stringify!(__atomic_wide_counter))
    );
    assert_eq!(
        ::std::mem::align_of::<__atomic_wide_counter>(),
        8usize,
        concat!("Alignment of ", stringify!(__atomic_wide_counter))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__value64) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter),
            "::",
            stringify!(__value64)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__value32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter),
            "::",
            stringify!(__value32)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[test]
fn bindgen_test_layout___pthread_internal_list() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_internal_list> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_list>(),
        16usize,
        concat!("Size of: ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_list>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__prev) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__prev)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__next)
        )
    );
}
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[test]
fn bindgen_test_layout___pthread_internal_slist() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_internal_slist> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__next) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_slist),
            "::",
            stringify!(__next)
        )
    );
}
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[test]
fn bindgen_test_layout___pthread_mutex_s() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_mutex_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_mutex_s>(),
        40usize,
        concat!("Size of: ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_mutex_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__lock) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__lock)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__count) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__owner) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__owner)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__nusers) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__nusers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__kind) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__kind)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__spins) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__spins)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__elision) as usize - ptr as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__elision)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__list) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__list)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __cur_writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __rwelision: ::std::os::raw::c_schar,
    pub __pad1: [::std::os::raw::c_uchar; 7usize],
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_rwlock_arch_t() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_rwlock_arch_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_rwlock_arch_t>(),
        56usize,
        concat!("Size of: ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_rwlock_arch_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__readers) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__readers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__writers) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wrphase_futex) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__wrphase_futex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__writers_futex) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers_futex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad3) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad4) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__cur_writer) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__cur_writer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__shared) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__shared)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__rwelision) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__rwelision)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad1) as usize - ptr as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad2) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__flags) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__flags)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __wseq: __atomic_wide_counter,
    pub __g1_start: __atomic_wide_counter,
    pub __g_refs: [::std::os::raw::c_uint; 2usize],
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
}
#[test]
fn bindgen_test_layout___pthread_cond_s() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_cond_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s>(),
        48usize,
        concat!("Size of: ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wseq) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__wseq)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g1_start) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g1_start)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g_refs) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_refs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g_size) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g1_orig_size) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g1_orig_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wrefs) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__wrefs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g_signals) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_signals)
        )
    );
}
pub type __tss_t = ::std::os::raw::c_uint;
pub type __thrd_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __once_flag {
    pub __data: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout___once_flag() {
    const UNINIT: ::std::mem::MaybeUninit<__once_flag> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__once_flag>(),
        4usize,
        concat!("Size of: ", stringify!(__once_flag))
    );
    assert_eq!(
        ::std::mem::align_of::<__once_flag>(),
        4usize,
        concat!("Alignment of ", stringify!(__once_flag))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__once_flag),
            "::",
            stringify!(__data)
        )
    );
}
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_mutexattr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pthread_condattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_condattr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_condattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_condattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_attr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_attr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_attr_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_attr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_mutex_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_mutex_t>(),
        40usize,
        concat!("Size of: ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout_pthread_cond_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_cond_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_rwlock_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlock_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlock_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_rwlockattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_rwlockattr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_barrier_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_barrier_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_barrier_t>(),
        32usize,
        concat!("Size of: ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrier_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pthread_barrierattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_barrierattr_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__align)
        )
    );
}
extern "C" {
    pub fn random() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn srandom(__seed: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn initstate(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: usize,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn setstate(__statebuf: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct random_data {
    pub fptr: *mut i32,
    pub rptr: *mut i32,
    pub state: *mut i32,
    pub rand_type: ::std::os::raw::c_int,
    pub rand_deg: ::std::os::raw::c_int,
    pub rand_sep: ::std::os::raw::c_int,
    pub end_ptr: *mut i32,
}
#[test]
fn bindgen_test_layout_random_data() {
    const UNINIT: ::std::mem::MaybeUninit<random_data> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<random_data>(),
        48usize,
        concat!("Size of: ", stringify!(random_data))
    );
    assert_eq!(
        ::std::mem::align_of::<random_data>(),
        8usize,
        concat!("Alignment of ", stringify!(random_data))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fptr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(fptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rptr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rand_type) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rand_deg) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_deg)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rand_sep) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_sep)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).end_ptr) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(end_ptr)
        )
    );
}
extern "C" {
    pub fn random_r(__buf: *mut random_data, __result: *mut i32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srandom_r(
        __seed: ::std::os::raw::c_uint,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn initstate_r(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: usize,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setstate_r(
        __statebuf: *mut ::std::os::raw::c_char,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rand() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srand(__seed: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn rand_r(__seed: *mut ::std::os::raw::c_uint) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn drand48() -> f64;
}
extern "C" {
    pub fn erand48(__xsubi: *mut ::std::os::raw::c_ushort) -> f64;
}
extern "C" {
    pub fn lrand48() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn nrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn mrand48() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn jrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn srand48(__seedval: ::std::os::raw::c_long);
}
extern "C" {
    pub fn seed48(__seed16v: *mut ::std::os::raw::c_ushort) -> *mut ::std::os::raw::c_ushort;
}
extern "C" {
    pub fn lcong48(__param: *mut ::std::os::raw::c_ushort);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct drand48_data {
    pub __x: [::std::os::raw::c_ushort; 3usize],
    pub __old_x: [::std::os::raw::c_ushort; 3usize],
    pub __c: ::std::os::raw::c_ushort,
    pub __init: ::std::os::raw::c_ushort,
    pub __a: ::std::os::raw::c_ulonglong,
}
#[test]
fn bindgen_test_layout_drand48_data() {
    const UNINIT: ::std::mem::MaybeUninit<drand48_data> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<drand48_data>(),
        24usize,
        concat!("Size of: ", stringify!(drand48_data))
    );
    assert_eq!(
        ::std::mem::align_of::<drand48_data>(),
        8usize,
        concat!("Alignment of ", stringify!(drand48_data))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__old_x) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__old_x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__c) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__c)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__init) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__init)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__a) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__a)
        )
    );
}
extern "C" {
    pub fn drand48_r(__buffer: *mut drand48_data, __result: *mut f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn erand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut f64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn nrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn jrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srand48_r(
        __seedval: ::std::os::raw::c_long,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn seed48_r(
        __seed16v: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lcong48_r(
        __param: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn malloc(__size: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn calloc(
        __nmemb: ::std::os::raw::c_ulong,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn realloc(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn free(__ptr: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn reallocarray(
        __ptr: *mut ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn alloca(__size: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn valloc(__size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn posix_memalign(
        __memptr: *mut *mut ::std::os::raw::c_void,
        __alignment: usize,
        __size: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aligned_alloc(
        __alignment: ::std::os::raw::c_ulong,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn abort() -> !;
}
extern "C" {
    pub fn atexit(__func: ::std::option::Option<unsafe extern "C" fn()>) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn at_quick_exit(
        __func: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn on_exit(
        __func: ::std::option::Option<
            unsafe extern "C" fn(
                __status: ::std::os::raw::c_int,
                __arg: *mut ::std::os::raw::c_void,
            ),
        >,
        __arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn exit(__status: ::std::os::raw::c_int) -> !;
}
extern "C" {
    pub fn quick_exit(__status: ::std::os::raw::c_int) -> !;
}
extern "C" {
    pub fn _Exit(__status: ::std::os::raw::c_int) -> !;
}
extern "C" {
    pub fn getenv(__name: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn putenv(__string: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setenv(
        __name: *const ::std::os::raw::c_char,
        __value: *const ::std::os::raw::c_char,
        __replace: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn unsetenv(__name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearenv() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mktemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn mkstemp(__template: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkstemps(
        __template: *mut ::std::os::raw::c_char,
        __suffixlen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkdtemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn system(__command: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn realpath(
        __name: *const ::std::os::raw::c_char,
        __resolved: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
pub type __compar_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn bsearch(
        __key: *const ::std::os::raw::c_void,
        __base: *const ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
        __compar: __compar_fn_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn qsort(
        __base: *mut ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
        __compar: __compar_fn_t,
    );
}
extern "C" {
    pub fn abs(__x: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn labs(__x: ::std::os::raw::c_long) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llabs(__x: ::std::os::raw::c_longlong) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn div(__numer: ::std::os::raw::c_int, __denom: ::std::os::raw::c_int) -> div_t;
}
extern "C" {
    pub fn ldiv(__numer: ::std::os::raw::c_long, __denom: ::std::os::raw::c_long) -> ldiv_t;
}
extern "C" {
    pub fn lldiv(
        __numer: ::std::os::raw::c_longlong,
        __denom: ::std::os::raw::c_longlong,
    ) -> lldiv_t;
}
extern "C" {
    pub fn ecvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn gcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qecvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qfcvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qgcvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ecvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fcvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn qecvt_r(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn qfcvt_r(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mblen(__s: *const ::std::os::raw::c_char, __n: usize) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbtowc(
        __pwc: *mut wchar_t,
        __s: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wctomb(__s: *mut ::std::os::raw::c_char, __wchar: wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbstowcs(__pwcs: *mut wchar_t, __s: *const ::std::os::raw::c_char, __n: usize) -> usize;
}
extern "C" {
    pub fn wcstombs(__s: *mut ::std::os::raw::c_char, __pwcs: *const wchar_t, __n: usize) -> usize;
}
extern "C" {
    pub fn rpmatch(__response: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getsubopt(
        __optionp: *mut *mut ::std::os::raw::c_char,
        __tokens: *const *mut ::std::os::raw::c_char,
        __valuep: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getloadavg(__loadavg: *mut f64, __nelem: ::std::os::raw::c_int)
        -> ::std::os::raw::c_int;
}
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type __gwchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct imaxdiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_imaxdiv_t() {
    const UNINIT: ::std::mem::MaybeUninit<imaxdiv_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<imaxdiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(imaxdiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<imaxdiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(imaxdiv_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(imaxdiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(imaxdiv_t),
            "::",
            stringify!(rem)
        )
    );
}
extern "C" {
    pub fn imaxabs(__n: intmax_t) -> intmax_t;
}
extern "C" {
    pub fn imaxdiv(__numer: intmax_t, __denom: intmax_t) -> imaxdiv_t;
}
extern "C" {
    pub fn strtoimax(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn strtoumax(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
extern "C" {
    pub fn wcstoimax(
        __nptr: *const __gwchar_t,
        __endptr: *mut *mut __gwchar_t,
        __base: ::std::os::raw::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn wcstoumax(
        __nptr: *const __gwchar_t,
        __endptr: *mut *mut __gwchar_t,
        __base: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    const UNINIT: ::std::mem::MaybeUninit<max_align_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::std::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__clang_max_align_nonce1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__clang_max_align_nonce2) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
pub type float_t = f32;
pub type double_t = f64;
extern "C" {
    pub fn __fpclassify(__value: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __signbit(__value: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __isinf(__value: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __finite(__value: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __isnan(__value: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __iseqsig(__x: f64, __y: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __issignaling(__value: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn acos(__x: f64) -> f64;
}
extern "C" {
    pub fn __acos(__x: f64) -> f64;
}
extern "C" {
    pub fn asin(__x: f64) -> f64;
}
extern "C" {
    pub fn __asin(__x: f64) -> f64;
}
extern "C" {
    pub fn atan(__x: f64) -> f64;
}
extern "C" {
    pub fn __atan(__x: f64) -> f64;
}
extern "C" {
    pub fn atan2(__y: f64, __x: f64) -> f64;
}
extern "C" {
    pub fn __atan2(__y: f64, __x: f64) -> f64;
}
extern "C" {
    pub fn cos(__x: f64) -> f64;
}
extern "C" {
    pub fn __cos(__x: f64) -> f64;
}
extern "C" {
    pub fn sin(__x: f64) -> f64;
}
extern "C" {
    pub fn __sin(__x: f64) -> f64;
}
extern "C" {
    pub fn tan(__x: f64) -> f64;
}
extern "C" {
    pub fn __tan(__x: f64) -> f64;
}
extern "C" {
    pub fn cosh(__x: f64) -> f64;
}
extern "C" {
    pub fn __cosh(__x: f64) -> f64;
}
extern "C" {
    pub fn sinh(__x: f64) -> f64;
}
extern "C" {
    pub fn __sinh(__x: f64) -> f64;
}
extern "C" {
    pub fn tanh(__x: f64) -> f64;
}
extern "C" {
    pub fn __tanh(__x: f64) -> f64;
}
extern "C" {
    pub fn acosh(__x: f64) -> f64;
}
extern "C" {
    pub fn __acosh(__x: f64) -> f64;
}
extern "C" {
    pub fn asinh(__x: f64) -> f64;
}
extern "C" {
    pub fn __asinh(__x: f64) -> f64;
}
extern "C" {
    pub fn atanh(__x: f64) -> f64;
}
extern "C" {
    pub fn __atanh(__x: f64) -> f64;
}
extern "C" {
    pub fn exp(__x: f64) -> f64;
}
extern "C" {
    pub fn __exp(__x: f64) -> f64;
}
extern "C" {
    pub fn frexp(__x: f64, __exponent: *mut ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn __frexp(__x: f64, __exponent: *mut ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn ldexp(__x: f64, __exponent: ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn __ldexp(__x: f64, __exponent: ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn log(__x: f64) -> f64;
}
extern "C" {
    pub fn __log(__x: f64) -> f64;
}
extern "C" {
    pub fn log10(__x: f64) -> f64;
}
extern "C" {
    pub fn __log10(__x: f64) -> f64;
}
extern "C" {
    pub fn modf(__x: f64, __iptr: *mut f64) -> f64;
}
extern "C" {
    pub fn __modf(__x: f64, __iptr: *mut f64) -> f64;
}
extern "C" {
    pub fn expm1(__x: f64) -> f64;
}
extern "C" {
    pub fn __expm1(__x: f64) -> f64;
}
extern "C" {
    pub fn log1p(__x: f64) -> f64;
}
extern "C" {
    pub fn __log1p(__x: f64) -> f64;
}
extern "C" {
    pub fn logb(__x: f64) -> f64;
}
extern "C" {
    pub fn __logb(__x: f64) -> f64;
}
extern "C" {
    pub fn exp2(__x: f64) -> f64;
}
extern "C" {
    pub fn __exp2(__x: f64) -> f64;
}
extern "C" {
    pub fn log2(__x: f64) -> f64;
}
extern "C" {
    pub fn __log2(__x: f64) -> f64;
}
extern "C" {
    pub fn pow(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __pow(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn sqrt(__x: f64) -> f64;
}
extern "C" {
    pub fn __sqrt(__x: f64) -> f64;
}
extern "C" {
    pub fn hypot(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __hypot(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn cbrt(__x: f64) -> f64;
}
extern "C" {
    pub fn __cbrt(__x: f64) -> f64;
}
extern "C" {
    pub fn ceil(__x: f64) -> f64;
}
extern "C" {
    pub fn __ceil(__x: f64) -> f64;
}
extern "C" {
    pub fn fabs(__x: f64) -> f64;
}
extern "C" {
    pub fn __fabs(__x: f64) -> f64;
}
extern "C" {
    pub fn floor(__x: f64) -> f64;
}
extern "C" {
    pub fn __floor(__x: f64) -> f64;
}
extern "C" {
    pub fn fmod(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __fmod(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn isinf(__value: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn finite(__value: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn drem(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __drem(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn significand(__x: f64) -> f64;
}
extern "C" {
    pub fn __significand(__x: f64) -> f64;
}
extern "C" {
    pub fn copysign(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __copysign(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn nan(__tagb: *const ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn __nan(__tagb: *const ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn isnan(__value: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn j0(arg1: f64) -> f64;
}
extern "C" {
    pub fn __j0(arg1: f64) -> f64;
}
extern "C" {
    pub fn j1(arg1: f64) -> f64;
}
extern "C" {
    pub fn __j1(arg1: f64) -> f64;
}
extern "C" {
    pub fn jn(arg1: ::std::os::raw::c_int, arg2: f64) -> f64;
}
extern "C" {
    pub fn __jn(arg1: ::std::os::raw::c_int, arg2: f64) -> f64;
}
extern "C" {
    pub fn y0(arg1: f64) -> f64;
}
extern "C" {
    pub fn __y0(arg1: f64) -> f64;
}
extern "C" {
    pub fn y1(arg1: f64) -> f64;
}
extern "C" {
    pub fn __y1(arg1: f64) -> f64;
}
extern "C" {
    pub fn yn(arg1: ::std::os::raw::c_int, arg2: f64) -> f64;
}
extern "C" {
    pub fn __yn(arg1: ::std::os::raw::c_int, arg2: f64) -> f64;
}
extern "C" {
    pub fn erf(arg1: f64) -> f64;
}
extern "C" {
    pub fn __erf(arg1: f64) -> f64;
}
extern "C" {
    pub fn erfc(arg1: f64) -> f64;
}
extern "C" {
    pub fn __erfc(arg1: f64) -> f64;
}
extern "C" {
    pub fn lgamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn __lgamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn tgamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn __tgamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn gamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn __gamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn lgamma_r(arg1: f64, __signgamp: *mut ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn __lgamma_r(arg1: f64, __signgamp: *mut ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn rint(__x: f64) -> f64;
}
extern "C" {
    pub fn __rint(__x: f64) -> f64;
}
extern "C" {
    pub fn nextafter(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __nextafter(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn nexttoward(__x: f64, __y: u128) -> f64;
}
extern "C" {
    pub fn __nexttoward(__x: f64, __y: u128) -> f64;
}
extern "C" {
    pub fn remainder(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __remainder(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn scalbn(__x: f64, __n: ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn __scalbn(__x: f64, __n: ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn ilogb(__x: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __ilogb(__x: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn scalbln(__x: f64, __n: ::std::os::raw::c_long) -> f64;
}
extern "C" {
    pub fn __scalbln(__x: f64, __n: ::std::os::raw::c_long) -> f64;
}
extern "C" {
    pub fn nearbyint(__x: f64) -> f64;
}
extern "C" {
    pub fn __nearbyint(__x: f64) -> f64;
}
extern "C" {
    pub fn round(__x: f64) -> f64;
}
extern "C" {
    pub fn __round(__x: f64) -> f64;
}
extern "C" {
    pub fn trunc(__x: f64) -> f64;
}
extern "C" {
    pub fn __trunc(__x: f64) -> f64;
}
extern "C" {
    pub fn remquo(__x: f64, __y: f64, __quo: *mut ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn __remquo(__x: f64, __y: f64, __quo: *mut ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn lrint(__x: f64) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn __lrint(__x: f64) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llrint(__x: f64) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn __llrint(__x: f64) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn lround(__x: f64) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn __lround(__x: f64) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llround(__x: f64) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn __llround(__x: f64) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn fdim(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __fdim(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn fmax(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __fmax(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn fmin(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __fmin(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn fma(__x: f64, __y: f64, __z: f64) -> f64;
}
extern "C" {
    pub fn __fma(__x: f64, __y: f64, __z: f64) -> f64;
}
extern "C" {
    pub fn scalb(__x: f64, __n: f64) -> f64;
}
extern "C" {
    pub fn __scalb(__x: f64, __n: f64) -> f64;
}
extern "C" {
    pub fn __fpclassifyf(__value: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __signbitf(__value: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __isinff(__value: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __finitef(__value: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __isnanf(__value: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __iseqsigf(__x: f32, __y: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __issignalingf(__value: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn acosf(__x: f32) -> f32;
}
extern "C" {
    pub fn __acosf(__x: f32) -> f32;
}
extern "C" {
    pub fn asinf(__x: f32) -> f32;
}
extern "C" {
    pub fn __asinf(__x: f32) -> f32;
}
extern "C" {
    pub fn atanf(__x: f32) -> f32;
}
extern "C" {
    pub fn __atanf(__x: f32) -> f32;
}
extern "C" {
    pub fn atan2f(__y: f32, __x: f32) -> f32;
}
extern "C" {
    pub fn __atan2f(__y: f32, __x: f32) -> f32;
}
extern "C" {
    pub fn cosf(__x: f32) -> f32;
}
extern "C" {
    pub fn __cosf(__x: f32) -> f32;
}
extern "C" {
    pub fn sinf(__x: f32) -> f32;
}
extern "C" {
    pub fn __sinf(__x: f32) -> f32;
}
extern "C" {
    pub fn tanf(__x: f32) -> f32;
}
extern "C" {
    pub fn __tanf(__x: f32) -> f32;
}
extern "C" {
    pub fn coshf(__x: f32) -> f32;
}
extern "C" {
    pub fn __coshf(__x: f32) -> f32;
}
extern "C" {
    pub fn sinhf(__x: f32) -> f32;
}
extern "C" {
    pub fn __sinhf(__x: f32) -> f32;
}
extern "C" {
    pub fn tanhf(__x: f32) -> f32;
}
extern "C" {
    pub fn __tanhf(__x: f32) -> f32;
}
extern "C" {
    pub fn acoshf(__x: f32) -> f32;
}
extern "C" {
    pub fn __acoshf(__x: f32) -> f32;
}
extern "C" {
    pub fn asinhf(__x: f32) -> f32;
}
extern "C" {
    pub fn __asinhf(__x: f32) -> f32;
}
extern "C" {
    pub fn atanhf(__x: f32) -> f32;
}
extern "C" {
    pub fn __atanhf(__x: f32) -> f32;
}
extern "C" {
    pub fn expf(__x: f32) -> f32;
}
extern "C" {
    pub fn __expf(__x: f32) -> f32;
}
extern "C" {
    pub fn frexpf(__x: f32, __exponent: *mut ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn __frexpf(__x: f32, __exponent: *mut ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn ldexpf(__x: f32, __exponent: ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn __ldexpf(__x: f32, __exponent: ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn logf(__x: f32) -> f32;
}
extern "C" {
    pub fn __logf(__x: f32) -> f32;
}
extern "C" {
    pub fn log10f(__x: f32) -> f32;
}
extern "C" {
    pub fn __log10f(__x: f32) -> f32;
}
extern "C" {
    pub fn modff(__x: f32, __iptr: *mut f32) -> f32;
}
extern "C" {
    pub fn __modff(__x: f32, __iptr: *mut f32) -> f32;
}
extern "C" {
    pub fn expm1f(__x: f32) -> f32;
}
extern "C" {
    pub fn __expm1f(__x: f32) -> f32;
}
extern "C" {
    pub fn log1pf(__x: f32) -> f32;
}
extern "C" {
    pub fn __log1pf(__x: f32) -> f32;
}
extern "C" {
    pub fn logbf(__x: f32) -> f32;
}
extern "C" {
    pub fn __logbf(__x: f32) -> f32;
}
extern "C" {
    pub fn exp2f(__x: f32) -> f32;
}
extern "C" {
    pub fn __exp2f(__x: f32) -> f32;
}
extern "C" {
    pub fn log2f(__x: f32) -> f32;
}
extern "C" {
    pub fn __log2f(__x: f32) -> f32;
}
extern "C" {
    pub fn powf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __powf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn sqrtf(__x: f32) -> f32;
}
extern "C" {
    pub fn __sqrtf(__x: f32) -> f32;
}
extern "C" {
    pub fn hypotf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __hypotf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn cbrtf(__x: f32) -> f32;
}
extern "C" {
    pub fn __cbrtf(__x: f32) -> f32;
}
extern "C" {
    pub fn ceilf(__x: f32) -> f32;
}
extern "C" {
    pub fn __ceilf(__x: f32) -> f32;
}
extern "C" {
    pub fn fabsf(__x: f32) -> f32;
}
extern "C" {
    pub fn __fabsf(__x: f32) -> f32;
}
extern "C" {
    pub fn floorf(__x: f32) -> f32;
}
extern "C" {
    pub fn __floorf(__x: f32) -> f32;
}
extern "C" {
    pub fn fmodf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __fmodf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn isinff(__value: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn finitef(__value: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dremf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __dremf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn significandf(__x: f32) -> f32;
}
extern "C" {
    pub fn __significandf(__x: f32) -> f32;
}
extern "C" {
    pub fn copysignf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __copysignf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn nanf(__tagb: *const ::std::os::raw::c_char) -> f32;
}
extern "C" {
    pub fn __nanf(__tagb: *const ::std::os::raw::c_char) -> f32;
}
extern "C" {
    pub fn isnanf(__value: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn j0f(arg1: f32) -> f32;
}
extern "C" {
    pub fn __j0f(arg1: f32) -> f32;
}
extern "C" {
    pub fn j1f(arg1: f32) -> f32;
}
extern "C" {
    pub fn __j1f(arg1: f32) -> f32;
}
extern "C" {
    pub fn jnf(arg1: ::std::os::raw::c_int, arg2: f32) -> f32;
}
extern "C" {
    pub fn __jnf(arg1: ::std::os::raw::c_int, arg2: f32) -> f32;
}
extern "C" {
    pub fn y0f(arg1: f32) -> f32;
}
extern "C" {
    pub fn __y0f(arg1: f32) -> f32;
}
extern "C" {
    pub fn y1f(arg1: f32) -> f32;
}
extern "C" {
    pub fn __y1f(arg1: f32) -> f32;
}
extern "C" {
    pub fn ynf(arg1: ::std::os::raw::c_int, arg2: f32) -> f32;
}
extern "C" {
    pub fn __ynf(arg1: ::std::os::raw::c_int, arg2: f32) -> f32;
}
extern "C" {
    pub fn erff(arg1: f32) -> f32;
}
extern "C" {
    pub fn __erff(arg1: f32) -> f32;
}
extern "C" {
    pub fn erfcf(arg1: f32) -> f32;
}
extern "C" {
    pub fn __erfcf(arg1: f32) -> f32;
}
extern "C" {
    pub fn lgammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn __lgammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn tgammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn __tgammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn gammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn __gammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn lgammaf_r(arg1: f32, __signgamp: *mut ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn __lgammaf_r(arg1: f32, __signgamp: *mut ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn rintf(__x: f32) -> f32;
}
extern "C" {
    pub fn __rintf(__x: f32) -> f32;
}
extern "C" {
    pub fn nextafterf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __nextafterf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn nexttowardf(__x: f32, __y: u128) -> f32;
}
extern "C" {
    pub fn __nexttowardf(__x: f32, __y: u128) -> f32;
}
extern "C" {
    pub fn remainderf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __remainderf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn scalbnf(__x: f32, __n: ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn __scalbnf(__x: f32, __n: ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn ilogbf(__x: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __ilogbf(__x: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn scalblnf(__x: f32, __n: ::std::os::raw::c_long) -> f32;
}
extern "C" {
    pub fn __scalblnf(__x: f32, __n: ::std::os::raw::c_long) -> f32;
}
extern "C" {
    pub fn nearbyintf(__x: f32) -> f32;
}
extern "C" {
    pub fn __nearbyintf(__x: f32) -> f32;
}
extern "C" {
    pub fn roundf(__x: f32) -> f32;
}
extern "C" {
    pub fn __roundf(__x: f32) -> f32;
}
extern "C" {
    pub fn truncf(__x: f32) -> f32;
}
extern "C" {
    pub fn __truncf(__x: f32) -> f32;
}
extern "C" {
    pub fn remquof(__x: f32, __y: f32, __quo: *mut ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn __remquof(__x: f32, __y: f32, __quo: *mut ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn lrintf(__x: f32) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn __lrintf(__x: f32) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llrintf(__x: f32) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn __llrintf(__x: f32) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn lroundf(__x: f32) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn __lroundf(__x: f32) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llroundf(__x: f32) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn __llroundf(__x: f32) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn fdimf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __fdimf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn fmaxf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __fmaxf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn fminf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __fminf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn fmaf(__x: f32, __y: f32, __z: f32) -> f32;
}
extern "C" {
    pub fn __fmaf(__x: f32, __y: f32, __z: f32) -> f32;
}
extern "C" {
    pub fn scalbf(__x: f32, __n: f32) -> f32;
}
extern "C" {
    pub fn __scalbf(__x: f32, __n: f32) -> f32;
}
extern "C" {
    pub fn __fpclassifyl(__value: u128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __signbitl(__value: u128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __isinfl(__value: u128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __finitel(__value: u128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __isnanl(__value: u128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __iseqsigl(__x: u128, __y: u128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __issignalingl(__value: u128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn acosl(__x: u128) -> u128;
}
extern "C" {
    pub fn __acosl(__x: u128) -> u128;
}
extern "C" {
    pub fn asinl(__x: u128) -> u128;
}
extern "C" {
    pub fn __asinl(__x: u128) -> u128;
}
extern "C" {
    pub fn atanl(__x: u128) -> u128;
}
extern "C" {
    pub fn __atanl(__x: u128) -> u128;
}
extern "C" {
    pub fn atan2l(__y: u128, __x: u128) -> u128;
}
extern "C" {
    pub fn __atan2l(__y: u128, __x: u128) -> u128;
}
extern "C" {
    pub fn cosl(__x: u128) -> u128;
}
extern "C" {
    pub fn __cosl(__x: u128) -> u128;
}
extern "C" {
    pub fn sinl(__x: u128) -> u128;
}
extern "C" {
    pub fn __sinl(__x: u128) -> u128;
}
extern "C" {
    pub fn tanl(__x: u128) -> u128;
}
extern "C" {
    pub fn __tanl(__x: u128) -> u128;
}
extern "C" {
    pub fn coshl(__x: u128) -> u128;
}
extern "C" {
    pub fn __coshl(__x: u128) -> u128;
}
extern "C" {
    pub fn sinhl(__x: u128) -> u128;
}
extern "C" {
    pub fn __sinhl(__x: u128) -> u128;
}
extern "C" {
    pub fn tanhl(__x: u128) -> u128;
}
extern "C" {
    pub fn __tanhl(__x: u128) -> u128;
}
extern "C" {
    pub fn acoshl(__x: u128) -> u128;
}
extern "C" {
    pub fn __acoshl(__x: u128) -> u128;
}
extern "C" {
    pub fn asinhl(__x: u128) -> u128;
}
extern "C" {
    pub fn __asinhl(__x: u128) -> u128;
}
extern "C" {
    pub fn atanhl(__x: u128) -> u128;
}
extern "C" {
    pub fn __atanhl(__x: u128) -> u128;
}
extern "C" {
    pub fn expl(__x: u128) -> u128;
}
extern "C" {
    pub fn __expl(__x: u128) -> u128;
}
extern "C" {
    pub fn frexpl(__x: u128, __exponent: *mut ::std::os::raw::c_int) -> u128;
}
extern "C" {
    pub fn __frexpl(__x: u128, __exponent: *mut ::std::os::raw::c_int) -> u128;
}
extern "C" {
    pub fn ldexpl(__x: u128, __exponent: ::std::os::raw::c_int) -> u128;
}
extern "C" {
    pub fn __ldexpl(__x: u128, __exponent: ::std::os::raw::c_int) -> u128;
}
extern "C" {
    pub fn logl(__x: u128) -> u128;
}
extern "C" {
    pub fn __logl(__x: u128) -> u128;
}
extern "C" {
    pub fn log10l(__x: u128) -> u128;
}
extern "C" {
    pub fn __log10l(__x: u128) -> u128;
}
extern "C" {
    pub fn modfl(__x: u128, __iptr: *mut u128) -> u128;
}
extern "C" {
    pub fn __modfl(__x: u128, __iptr: *mut u128) -> u128;
}
extern "C" {
    pub fn expm1l(__x: u128) -> u128;
}
extern "C" {
    pub fn __expm1l(__x: u128) -> u128;
}
extern "C" {
    pub fn log1pl(__x: u128) -> u128;
}
extern "C" {
    pub fn __log1pl(__x: u128) -> u128;
}
extern "C" {
    pub fn logbl(__x: u128) -> u128;
}
extern "C" {
    pub fn __logbl(__x: u128) -> u128;
}
extern "C" {
    pub fn exp2l(__x: u128) -> u128;
}
extern "C" {
    pub fn __exp2l(__x: u128) -> u128;
}
extern "C" {
    pub fn log2l(__x: u128) -> u128;
}
extern "C" {
    pub fn __log2l(__x: u128) -> u128;
}
extern "C" {
    pub fn powl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn __powl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn sqrtl(__x: u128) -> u128;
}
extern "C" {
    pub fn __sqrtl(__x: u128) -> u128;
}
extern "C" {
    pub fn hypotl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn __hypotl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn cbrtl(__x: u128) -> u128;
}
extern "C" {
    pub fn __cbrtl(__x: u128) -> u128;
}
extern "C" {
    pub fn ceill(__x: u128) -> u128;
}
extern "C" {
    pub fn __ceill(__x: u128) -> u128;
}
extern "C" {
    pub fn fabsl(__x: u128) -> u128;
}
extern "C" {
    pub fn __fabsl(__x: u128) -> u128;
}
extern "C" {
    pub fn floorl(__x: u128) -> u128;
}
extern "C" {
    pub fn __floorl(__x: u128) -> u128;
}
extern "C" {
    pub fn fmodl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn __fmodl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn isinfl(__value: u128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn finitel(__value: u128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dreml(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn __dreml(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn significandl(__x: u128) -> u128;
}
extern "C" {
    pub fn __significandl(__x: u128) -> u128;
}
extern "C" {
    pub fn copysignl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn __copysignl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn nanl(__tagb: *const ::std::os::raw::c_char) -> u128;
}
extern "C" {
    pub fn __nanl(__tagb: *const ::std::os::raw::c_char) -> u128;
}
extern "C" {
    pub fn isnanl(__value: u128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn j0l(arg1: u128) -> u128;
}
extern "C" {
    pub fn __j0l(arg1: u128) -> u128;
}
extern "C" {
    pub fn j1l(arg1: u128) -> u128;
}
extern "C" {
    pub fn __j1l(arg1: u128) -> u128;
}
extern "C" {
    pub fn jnl(arg1: ::std::os::raw::c_int, arg2: u128) -> u128;
}
extern "C" {
    pub fn __jnl(arg1: ::std::os::raw::c_int, arg2: u128) -> u128;
}
extern "C" {
    pub fn y0l(arg1: u128) -> u128;
}
extern "C" {
    pub fn __y0l(arg1: u128) -> u128;
}
extern "C" {
    pub fn y1l(arg1: u128) -> u128;
}
extern "C" {
    pub fn __y1l(arg1: u128) -> u128;
}
extern "C" {
    pub fn ynl(arg1: ::std::os::raw::c_int, arg2: u128) -> u128;
}
extern "C" {
    pub fn __ynl(arg1: ::std::os::raw::c_int, arg2: u128) -> u128;
}
extern "C" {
    pub fn erfl(arg1: u128) -> u128;
}
extern "C" {
    pub fn __erfl(arg1: u128) -> u128;
}
extern "C" {
    pub fn erfcl(arg1: u128) -> u128;
}
extern "C" {
    pub fn __erfcl(arg1: u128) -> u128;
}
extern "C" {
    pub fn lgammal(arg1: u128) -> u128;
}
extern "C" {
    pub fn __lgammal(arg1: u128) -> u128;
}
extern "C" {
    pub fn tgammal(arg1: u128) -> u128;
}
extern "C" {
    pub fn __tgammal(arg1: u128) -> u128;
}
extern "C" {
    pub fn gammal(arg1: u128) -> u128;
}
extern "C" {
    pub fn __gammal(arg1: u128) -> u128;
}
extern "C" {
    pub fn lgammal_r(arg1: u128, __signgamp: *mut ::std::os::raw::c_int) -> u128;
}
extern "C" {
    pub fn __lgammal_r(arg1: u128, __signgamp: *mut ::std::os::raw::c_int) -> u128;
}
extern "C" {
    pub fn rintl(__x: u128) -> u128;
}
extern "C" {
    pub fn __rintl(__x: u128) -> u128;
}
extern "C" {
    pub fn nextafterl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn __nextafterl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn nexttowardl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn __nexttowardl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn remainderl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn __remainderl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn scalbnl(__x: u128, __n: ::std::os::raw::c_int) -> u128;
}
extern "C" {
    pub fn __scalbnl(__x: u128, __n: ::std::os::raw::c_int) -> u128;
}
extern "C" {
    pub fn ilogbl(__x: u128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __ilogbl(__x: u128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn scalblnl(__x: u128, __n: ::std::os::raw::c_long) -> u128;
}
extern "C" {
    pub fn __scalblnl(__x: u128, __n: ::std::os::raw::c_long) -> u128;
}
extern "C" {
    pub fn nearbyintl(__x: u128) -> u128;
}
extern "C" {
    pub fn __nearbyintl(__x: u128) -> u128;
}
extern "C" {
    pub fn roundl(__x: u128) -> u128;
}
extern "C" {
    pub fn __roundl(__x: u128) -> u128;
}
extern "C" {
    pub fn truncl(__x: u128) -> u128;
}
extern "C" {
    pub fn __truncl(__x: u128) -> u128;
}
extern "C" {
    pub fn remquol(__x: u128, __y: u128, __quo: *mut ::std::os::raw::c_int) -> u128;
}
extern "C" {
    pub fn __remquol(__x: u128, __y: u128, __quo: *mut ::std::os::raw::c_int) -> u128;
}
extern "C" {
    pub fn lrintl(__x: u128) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn __lrintl(__x: u128) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llrintl(__x: u128) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn __llrintl(__x: u128) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn lroundl(__x: u128) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn __lroundl(__x: u128) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llroundl(__x: u128) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn __llroundl(__x: u128) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn fdiml(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn __fdiml(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn fmaxl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn __fmaxl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn fminl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn __fminl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn fmal(__x: u128, __y: u128, __z: u128) -> u128;
}
extern "C" {
    pub fn __fmal(__x: u128, __y: u128, __z: u128) -> u128;
}
extern "C" {
    pub fn scalbl(__x: u128, __n: u128) -> u128;
}
extern "C" {
    pub fn __scalbl(__x: u128, __n: u128) -> u128;
}
extern "C" {
    pub static mut signgam: ::std::os::raw::c_int;
}
pub const FP_NAN: _bindgen_ty_1 = 0;
pub const FP_INFINITE: _bindgen_ty_1 = 1;
pub const FP_ZERO: _bindgen_ty_1 = 2;
pub const FP_SUBNORMAL: _bindgen_ty_1 = 3;
pub const FP_NORMAL: _bindgen_ty_1 = 4;
pub type _bindgen_ty_1 = ::std::os::raw::c_uint;
extern "C" {
    pub fn cacos(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn __cacos(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn casin(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn __casin(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn catan(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn __catan(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn ccos(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn __ccos(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn csin(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn __csin(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn ctan(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn __ctan(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn cacosh(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn __cacosh(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn casinh(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn __casinh(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn catanh(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn __catanh(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn ccosh(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn __ccosh(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn csinh(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn __csinh(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn ctanh(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn __ctanh(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn cexp(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn __cexp(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn clog(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn __clog(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn cpow(__x: __BindgenComplex<f64>, __y: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn __cpow(__x: __BindgenComplex<f64>, __y: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn csqrt(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn __csqrt(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn cabs(__z: __BindgenComplex<f64>) -> f64;
}
extern "C" {
    pub fn __cabs(__z: __BindgenComplex<f64>) -> f64;
}
extern "C" {
    pub fn carg(__z: __BindgenComplex<f64>) -> f64;
}
extern "C" {
    pub fn __carg(__z: __BindgenComplex<f64>) -> f64;
}
extern "C" {
    pub fn conj(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn __conj(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn cproj(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn __cproj(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn cimag(__z: __BindgenComplex<f64>) -> f64;
}
extern "C" {
    pub fn __cimag(__z: __BindgenComplex<f64>) -> f64;
}
extern "C" {
    pub fn creal(__z: __BindgenComplex<f64>) -> f64;
}
extern "C" {
    pub fn __creal(__z: __BindgenComplex<f64>) -> f64;
}
extern "C" {
    pub fn cacosf(__z: __BindgenComplex<f32>) -> __BindgenComplex<f32>;
}
extern "C" {
    pub fn __cacosf(__z: __BindgenComplex<f32>) -> __BindgenComplex<f32>;
}
extern "C" {
    pub fn casinf(__z: __BindgenComplex<f32>) -> __BindgenComplex<f32>;
}
extern "C" {
    pub fn __casinf(__z: __BindgenComplex<f32>) -> __BindgenComplex<f32>;
}
extern "C" {
    pub fn catanf(__z: __BindgenComplex<f32>) -> __BindgenComplex<f32>;
}
extern "C" {
    pub fn __catanf(__z: __BindgenComplex<f32>) -> __BindgenComplex<f32>;
}
extern "C" {
    pub fn ccosf(__z: __BindgenComplex<f32>) -> __BindgenComplex<f32>;
}
extern "C" {
    pub fn __ccosf(__z: __BindgenComplex<f32>) -> __BindgenComplex<f32>;
}
extern "C" {
    pub fn csinf(__z: __BindgenComplex<f32>) -> __BindgenComplex<f32>;
}
extern "C" {
    pub fn __csinf(__z: __BindgenComplex<f32>) -> __BindgenComplex<f32>;
}
extern "C" {
    pub fn ctanf(__z: __BindgenComplex<f32>) -> __BindgenComplex<f32>;
}
extern "C" {
    pub fn __ctanf(__z: __BindgenComplex<f32>) -> __BindgenComplex<f32>;
}
extern "C" {
    pub fn cacoshf(__z: __BindgenComplex<f32>) -> __BindgenComplex<f32>;
}
extern "C" {
    pub fn __cacoshf(__z: __BindgenComplex<f32>) -> __BindgenComplex<f32>;
}
extern "C" {
    pub fn casinhf(__z: __BindgenComplex<f32>) -> __BindgenComplex<f32>;
}
extern "C" {
    pub fn __casinhf(__z: __BindgenComplex<f32>) -> __BindgenComplex<f32>;
}
extern "C" {
    pub fn catanhf(__z: __BindgenComplex<f32>) -> __BindgenComplex<f32>;
}
extern "C" {
    pub fn __catanhf(__z: __BindgenComplex<f32>) -> __BindgenComplex<f32>;
}
extern "C" {
    pub fn ccoshf(__z: __BindgenComplex<f32>) -> __BindgenComplex<f32>;
}
extern "C" {
    pub fn __ccoshf(__z: __BindgenComplex<f32>) -> __BindgenComplex<f32>;
}
extern "C" {
    pub fn csinhf(__z: __BindgenComplex<f32>) -> __BindgenComplex<f32>;
}
extern "C" {
    pub fn __csinhf(__z: __BindgenComplex<f32>) -> __BindgenComplex<f32>;
}
extern "C" {
    pub fn ctanhf(__z: __BindgenComplex<f32>) -> __BindgenComplex<f32>;
}
extern "C" {
    pub fn __ctanhf(__z: __BindgenComplex<f32>) -> __BindgenComplex<f32>;
}
extern "C" {
    pub fn cexpf(__z: __BindgenComplex<f32>) -> __BindgenComplex<f32>;
}
extern "C" {
    pub fn __cexpf(__z: __BindgenComplex<f32>) -> __BindgenComplex<f32>;
}
extern "C" {
    pub fn clogf(__z: __BindgenComplex<f32>) -> __BindgenComplex<f32>;
}
extern "C" {
    pub fn __clogf(__z: __BindgenComplex<f32>) -> __BindgenComplex<f32>;
}
extern "C" {
    pub fn cpowf(__x: __BindgenComplex<f32>, __y: __BindgenComplex<f32>) -> __BindgenComplex<f32>;
}
extern "C" {
    pub fn __cpowf(__x: __BindgenComplex<f32>, __y: __BindgenComplex<f32>)
        -> __BindgenComplex<f32>;
}
extern "C" {
    pub fn csqrtf(__z: __BindgenComplex<f32>) -> __BindgenComplex<f32>;
}
extern "C" {
    pub fn __csqrtf(__z: __BindgenComplex<f32>) -> __BindgenComplex<f32>;
}
extern "C" {
    pub fn cabsf(__z: __BindgenComplex<f32>) -> f32;
}
extern "C" {
    pub fn __cabsf(__z: __BindgenComplex<f32>) -> f32;
}
extern "C" {
    pub fn cargf(__z: __BindgenComplex<f32>) -> f32;
}
extern "C" {
    pub fn __cargf(__z: __BindgenComplex<f32>) -> f32;
}
extern "C" {
    pub fn conjf(__z: __BindgenComplex<f32>) -> __BindgenComplex<f32>;
}
extern "C" {
    pub fn __conjf(__z: __BindgenComplex<f32>) -> __BindgenComplex<f32>;
}
extern "C" {
    pub fn cprojf(__z: __BindgenComplex<f32>) -> __BindgenComplex<f32>;
}
extern "C" {
    pub fn __cprojf(__z: __BindgenComplex<f32>) -> __BindgenComplex<f32>;
}
extern "C" {
    pub fn cimagf(__z: __BindgenComplex<f32>) -> f32;
}
extern "C" {
    pub fn __cimagf(__z: __BindgenComplex<f32>) -> f32;
}
extern "C" {
    pub fn crealf(__z: __BindgenComplex<f32>) -> f32;
}
extern "C" {
    pub fn __crealf(__z: __BindgenComplex<f32>) -> f32;
}
extern "C" {
    pub fn cacosl(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn __cacosl(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn casinl(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn __casinl(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn catanl(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn __catanl(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn ccosl(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn __ccosl(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn csinl(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn __csinl(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn ctanl(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn __ctanl(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn cacoshl(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn __cacoshl(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn casinhl(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn __casinhl(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn catanhl(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn __catanhl(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn ccoshl(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn __ccoshl(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn csinhl(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn __csinhl(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn ctanhl(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn __ctanhl(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn cexpl(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn __cexpl(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn clogl(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn __clogl(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn cpowl(__x: __BindgenComplex<f64>, __y: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn __cpowl(__x: __BindgenComplex<f64>, __y: __BindgenComplex<f64>)
        -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn csqrtl(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn __csqrtl(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn cabsl(__z: __BindgenComplex<f64>) -> u128;
}
extern "C" {
    pub fn __cabsl(__z: __BindgenComplex<f64>) -> u128;
}
extern "C" {
    pub fn cargl(__z: __BindgenComplex<f64>) -> u128;
}
extern "C" {
    pub fn __cargl(__z: __BindgenComplex<f64>) -> u128;
}
extern "C" {
    pub fn conjl(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn __conjl(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn cprojl(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn __cprojl(__z: __BindgenComplex<f64>) -> __BindgenComplex<f64>;
}
extern "C" {
    pub fn cimagl(__z: __BindgenComplex<f64>) -> u128;
}
extern "C" {
    pub fn __cimagl(__z: __BindgenComplex<f64>) -> u128;
}
extern "C" {
    pub fn creall(__z: __BindgenComplex<f64>) -> u128;
}
extern "C" {
    pub fn __creall(__z: __BindgenComplex<f64>) -> u128;
}
pub type GxB_FC32_t = __BindgenComplex<f32>;
pub type GxB_FC64_t = __BindgenComplex<f64>;
pub type GrB_Index = u64;
pub const GrB_Info_GrB_SUCCESS: GrB_Info = 0;
pub const GrB_Info_GrB_NO_VALUE: GrB_Info = 1;
pub const GrB_Info_GxB_EXHAUSTED: GrB_Info = 7089;
pub const GrB_Info_GrB_UNINITIALIZED_OBJECT: GrB_Info = -1;
pub const GrB_Info_GrB_NULL_POINTER: GrB_Info = -2;
pub const GrB_Info_GrB_INVALID_VALUE: GrB_Info = -3;
pub const GrB_Info_GrB_INVALID_INDEX: GrB_Info = -4;
pub const GrB_Info_GrB_DOMAIN_MISMATCH: GrB_Info = -5;
pub const GrB_Info_GrB_DIMENSION_MISMATCH: GrB_Info = -6;
pub const GrB_Info_GrB_OUTPUT_NOT_EMPTY: GrB_Info = -7;
pub const GrB_Info_GrB_NOT_IMPLEMENTED: GrB_Info = -8;
pub const GrB_Info_GrB_ALREADY_SET: GrB_Info = -9;
pub const GrB_Info_GrB_PANIC: GrB_Info = -101;
pub const GrB_Info_GrB_OUT_OF_MEMORY: GrB_Info = -102;
pub const GrB_Info_GrB_INSUFFICIENT_SPACE: GrB_Info = -103;
pub const GrB_Info_GrB_INVALID_OBJECT: GrB_Info = -104;
pub const GrB_Info_GrB_INDEX_OUT_OF_BOUNDS: GrB_Info = -105;
pub const GrB_Info_GrB_EMPTY_OBJECT: GrB_Info = -106;
pub type GrB_Info = ::std::os::raw::c_int;
pub const GrB_Mode_GrB_NONBLOCKING: GrB_Mode = 0;
pub const GrB_Mode_GrB_BLOCKING: GrB_Mode = 1;
pub const GrB_Mode_GxB_NONBLOCKING_GPU: GrB_Mode = 7099;
pub const GrB_Mode_GxB_BLOCKING_GPU: GrB_Mode = 7098;
pub type GrB_Mode = ::std::os::raw::c_uint;
extern "C" {
    pub fn GrB_init(mode: GrB_Mode) -> GrB_Info;
}
extern "C" {
    pub fn GxB_init(
        mode: GrB_Mode,
        user_malloc_function: ::std::option::Option<
            unsafe extern "C" fn(arg1: usize) -> *mut ::std::os::raw::c_void,
        >,
        user_calloc_function: ::std::option::Option<
            unsafe extern "C" fn(arg1: usize, arg2: usize) -> *mut ::std::os::raw::c_void,
        >,
        user_realloc_function: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: usize,
            ) -> *mut ::std::os::raw::c_void,
        >,
        user_free_function: ::std::option::Option<
            unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void),
        >,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_finalize() -> GrB_Info;
}
extern "C" {
    pub fn GrB_getVersion(
        version: *mut ::std::os::raw::c_uint,
        subversion: *mut ::std::os::raw::c_uint,
    ) -> GrB_Info;
}
pub const GrB_Desc_Field_GrB_OUTP: GrB_Desc_Field = 0;
pub const GrB_Desc_Field_GrB_MASK: GrB_Desc_Field = 1;
pub const GrB_Desc_Field_GrB_INP0: GrB_Desc_Field = 2;
pub const GrB_Desc_Field_GrB_INP1: GrB_Desc_Field = 3;
pub const GrB_Desc_Field_GxB_AxB_METHOD: GrB_Desc_Field = 7090;
pub const GrB_Desc_Field_GxB_SORT: GrB_Desc_Field = 7091;
pub const GrB_Desc_Field_GxB_COMPRESSION: GrB_Desc_Field = 7092;
pub const GrB_Desc_Field_GxB_IMPORT: GrB_Desc_Field = 7093;
pub type GrB_Desc_Field = ::std::os::raw::c_uint;
pub const GrB_Desc_Value_GrB_DEFAULT: GrB_Desc_Value = 0;
pub const GrB_Desc_Value_GxB_DEFAULT: GrB_Desc_Value = 0;
pub const GrB_Desc_Value_GrB_REPLACE: GrB_Desc_Value = 1;
pub const GrB_Desc_Value_GrB_COMP: GrB_Desc_Value = 2;
pub const GrB_Desc_Value_GrB_STRUCTURE: GrB_Desc_Value = 4;
pub const GrB_Desc_Value_GrB_COMP_STRUCTURE: GrB_Desc_Value = 6;
pub const GrB_Desc_Value_GrB_TRAN: GrB_Desc_Value = 3;
pub const GrB_Desc_Value_GxB_AxB_GUSTAVSON: GrB_Desc_Value = 7081;
pub const GrB_Desc_Value_GxB_AxB_DOT: GrB_Desc_Value = 7083;
pub const GrB_Desc_Value_GxB_AxB_HASH: GrB_Desc_Value = 7084;
pub const GrB_Desc_Value_GxB_AxB_SAXPY: GrB_Desc_Value = 7085;
pub const GrB_Desc_Value_GxB_SECURE_IMPORT: GrB_Desc_Value = 7080;
pub type GrB_Desc_Value = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_Descriptor_opaque {
    _unused: [u8; 0],
}
pub type GrB_Descriptor = *mut GB_Descriptor_opaque;
extern "C" {
    pub fn GrB_Descriptor_new(descriptor: *mut GrB_Descriptor) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Descriptor_set(
        arg1: GrB_Descriptor,
        arg2: GrB_Desc_Field,
        arg3: GrB_Desc_Value,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Descriptor_get(
        arg1: *mut GrB_Desc_Value,
        arg2: GrB_Descriptor,
        arg3: GrB_Desc_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Desc_set(arg1: GrB_Descriptor, arg2: GrB_Desc_Field, ...) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Desc_set_INT32(arg1: GrB_Descriptor, arg2: GrB_Desc_Field, arg3: i32) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Desc_set_FP64(arg1: GrB_Descriptor, arg2: GrB_Desc_Field, arg3: f64) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Desc_get(arg1: GrB_Descriptor, arg2: GrB_Desc_Field, ...) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Desc_get_INT32(
        arg1: GrB_Descriptor,
        arg2: GrB_Desc_Field,
        arg3: *mut i32,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Desc_get_FP64(
        arg1: GrB_Descriptor,
        arg2: GrB_Desc_Field,
        arg3: *mut f64,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Descriptor_free(descriptor: *mut GrB_Descriptor) -> GrB_Info;
}
extern "C" {
    pub static mut GrB_DESC_T1: GrB_Descriptor;
}
extern "C" {
    pub static mut GrB_DESC_T0: GrB_Descriptor;
}
extern "C" {
    pub static mut GrB_DESC_T0T1: GrB_Descriptor;
}
extern "C" {
    pub static mut GrB_DESC_C: GrB_Descriptor;
}
extern "C" {
    pub static mut GrB_DESC_CT1: GrB_Descriptor;
}
extern "C" {
    pub static mut GrB_DESC_CT0: GrB_Descriptor;
}
extern "C" {
    pub static mut GrB_DESC_CT0T1: GrB_Descriptor;
}
extern "C" {
    pub static mut GrB_DESC_S: GrB_Descriptor;
}
extern "C" {
    pub static mut GrB_DESC_ST1: GrB_Descriptor;
}
extern "C" {
    pub static mut GrB_DESC_ST0: GrB_Descriptor;
}
extern "C" {
    pub static mut GrB_DESC_ST0T1: GrB_Descriptor;
}
extern "C" {
    pub static mut GrB_DESC_SC: GrB_Descriptor;
}
extern "C" {
    pub static mut GrB_DESC_SCT1: GrB_Descriptor;
}
extern "C" {
    pub static mut GrB_DESC_SCT0: GrB_Descriptor;
}
extern "C" {
    pub static mut GrB_DESC_SCT0T1: GrB_Descriptor;
}
extern "C" {
    pub static mut GrB_DESC_R: GrB_Descriptor;
}
extern "C" {
    pub static mut GrB_DESC_RT1: GrB_Descriptor;
}
extern "C" {
    pub static mut GrB_DESC_RT0: GrB_Descriptor;
}
extern "C" {
    pub static mut GrB_DESC_RT0T1: GrB_Descriptor;
}
extern "C" {
    pub static mut GrB_DESC_RC: GrB_Descriptor;
}
extern "C" {
    pub static mut GrB_DESC_RCT1: GrB_Descriptor;
}
extern "C" {
    pub static mut GrB_DESC_RCT0: GrB_Descriptor;
}
extern "C" {
    pub static mut GrB_DESC_RCT0T1: GrB_Descriptor;
}
extern "C" {
    pub static mut GrB_DESC_RS: GrB_Descriptor;
}
extern "C" {
    pub static mut GrB_DESC_RST1: GrB_Descriptor;
}
extern "C" {
    pub static mut GrB_DESC_RST0: GrB_Descriptor;
}
extern "C" {
    pub static mut GrB_DESC_RST0T1: GrB_Descriptor;
}
extern "C" {
    pub static mut GrB_DESC_RSC: GrB_Descriptor;
}
extern "C" {
    pub static mut GrB_DESC_RSCT1: GrB_Descriptor;
}
extern "C" {
    pub static mut GrB_DESC_RSCT0: GrB_Descriptor;
}
extern "C" {
    pub static mut GrB_DESC_RSCT0T1: GrB_Descriptor;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_Type_opaque {
    _unused: [u8; 0],
}
pub type GrB_Type = *mut GB_Type_opaque;
extern "C" {
    pub static mut GrB_BOOL: GrB_Type;
}
extern "C" {
    pub static mut GrB_INT8: GrB_Type;
}
extern "C" {
    pub static mut GrB_INT16: GrB_Type;
}
extern "C" {
    pub static mut GrB_INT32: GrB_Type;
}
extern "C" {
    pub static mut GrB_INT64: GrB_Type;
}
extern "C" {
    pub static mut GrB_UINT8: GrB_Type;
}
extern "C" {
    pub static mut GrB_UINT16: GrB_Type;
}
extern "C" {
    pub static mut GrB_UINT32: GrB_Type;
}
extern "C" {
    pub static mut GrB_UINT64: GrB_Type;
}
extern "C" {
    pub static mut GrB_FP32: GrB_Type;
}
extern "C" {
    pub static mut GrB_FP64: GrB_Type;
}
extern "C" {
    pub static mut GxB_FC32: GrB_Type;
}
extern "C" {
    pub static mut GxB_FC64: GrB_Type;
}
extern "C" {
    pub fn GrB_Type_new(type_: *mut GrB_Type, sizeof_ctype: usize) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Type_new(
        type_: *mut GrB_Type,
        sizeof_ctype: usize,
        type_name: *const ::std::os::raw::c_char,
        type_defn: *const ::std::os::raw::c_char,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Type_name(type_name: *mut ::std::os::raw::c_char, type_: GrB_Type) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Type_size(size: *mut usize, type_: GrB_Type) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Type_from_name(
        type_: *mut GrB_Type,
        type_name: *const ::std::os::raw::c_char,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Type_free(type_: *mut GrB_Type) -> GrB_Info;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_UnaryOp_opaque {
    _unused: [u8; 0],
}
pub type GrB_UnaryOp = *mut GB_UnaryOp_opaque;
extern "C" {
    pub static mut GrB_IDENTITY_BOOL: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_AINV_BOOL: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_MINV_BOOL: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_LNOT_BOOL: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_IDENTITY_INT8: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_AINV_INT8: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_MINV_INT8: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_LNOT_INT8: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_IDENTITY_INT16: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_AINV_INT16: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_MINV_INT16: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_LNOT_INT16: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_IDENTITY_INT32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_AINV_INT32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_MINV_INT32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_LNOT_INT32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_IDENTITY_INT64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_AINV_INT64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_MINV_INT64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_LNOT_INT64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_IDENTITY_UINT8: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_AINV_UINT8: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_MINV_UINT8: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_LNOT_UINT8: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_IDENTITY_UINT16: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_AINV_UINT16: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_MINV_UINT16: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_LNOT_UINT16: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_IDENTITY_UINT32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_AINV_UINT32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_MINV_UINT32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_LNOT_UINT32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_IDENTITY_UINT64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_AINV_UINT64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_MINV_UINT64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_LNOT_UINT64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_IDENTITY_FP32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_AINV_FP32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_MINV_FP32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_LNOT_FP32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_IDENTITY_FP64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_AINV_FP64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_MINV_FP64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_LNOT_FP64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_IDENTITY_FC32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_AINV_FC32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_MINV_FC32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_IDENTITY_FC64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_AINV_FC64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_MINV_FC64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ONE_BOOL: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_ABS_BOOL: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ONE_INT8: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_ABS_INT8: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_BNOT_INT8: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ONE_INT16: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_ABS_INT16: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_BNOT_INT16: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ONE_INT32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_ABS_INT32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_BNOT_INT32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ONE_INT64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_ABS_INT64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_BNOT_INT64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ONE_UINT8: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_ABS_UINT8: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_BNOT_UINT8: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ONE_UINT16: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_ABS_UINT16: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_BNOT_UINT16: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ONE_UINT32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_ABS_UINT32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_BNOT_UINT32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ONE_UINT64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_ABS_UINT64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_BNOT_UINT64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ONE_FP32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_ABS_FP32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ONE_FP64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_ABS_FP64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ONE_FC32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ONE_FC64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GrB_LNOT: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ABS_BOOL: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ABS_INT8: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ABS_INT16: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ABS_INT32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ABS_INT64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ABS_UINT8: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ABS_UINT16: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ABS_UINT32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ABS_UINT64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ABS_FP32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ABS_FP64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_SQRT_FP32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_LOG_FP32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_EXP_FP32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_LOG2_FP32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_SQRT_FP64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_LOG_FP64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_EXP_FP64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_LOG2_FP64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_SQRT_FC32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_LOG_FC32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_EXP_FC32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_LOG2_FC32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_SQRT_FC64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_LOG_FC64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_EXP_FC64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_LOG2_FC64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_SIN_FP32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_COS_FP32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_TAN_FP32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_SIN_FP64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_COS_FP64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_TAN_FP64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_SIN_FC32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_COS_FC32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_TAN_FC32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_SIN_FC64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_COS_FC64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_TAN_FC64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ACOS_FP32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ASIN_FP32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ATAN_FP32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ACOS_FP64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ASIN_FP64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ATAN_FP64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ACOS_FC32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ASIN_FC32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ATAN_FC32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ACOS_FC64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ASIN_FC64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ATAN_FC64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_SINH_FP32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_COSH_FP32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_TANH_FP32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_SINH_FP64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_COSH_FP64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_TANH_FP64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_SINH_FC32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_COSH_FC32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_TANH_FC32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_SINH_FC64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_COSH_FC64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_TANH_FC64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ACOSH_FP32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ASINH_FP32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ATANH_FP32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_SIGNUM_FP32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ACOSH_FP64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ASINH_FP64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ATANH_FP64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_SIGNUM_FP64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ACOSH_FC32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ASINH_FC32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ATANH_FC32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_SIGNUM_FC32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ACOSH_FC64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ASINH_FC64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ATANH_FC64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_SIGNUM_FC64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_CEIL_FP32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_FLOOR_FP32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ROUND_FP32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_TRUNC_FP32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_CEIL_FP64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_FLOOR_FP64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ROUND_FP64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_TRUNC_FP64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_CEIL_FC32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_FLOOR_FC32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ROUND_FC32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_TRUNC_FC32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_CEIL_FC64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_FLOOR_FC64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ROUND_FC64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_TRUNC_FC64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_EXP2_FP32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_EXPM1_FP32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_LOG10_FP32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_LOG1P_FP32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_EXP2_FP64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_EXPM1_FP64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_LOG10_FP64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_LOG1P_FP64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_EXP2_FC32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_EXPM1_FC32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_LOG10_FC32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_LOG1P_FC32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_EXP2_FC64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_EXPM1_FC64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_LOG10_FC64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_LOG1P_FC64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_LGAMMA_FP32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_TGAMMA_FP32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ERF_FP32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ERFC_FP32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_LGAMMA_FP64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_TGAMMA_FP64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ERF_FP64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ERFC_FP64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_CBRT_FP32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_CBRT_FP64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_FREXPX_FP32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_FREXPE_FP32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_FREXPX_FP64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_FREXPE_FP64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_CONJ_FC32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_CONJ_FC64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_CREAL_FC32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_CIMAG_FC32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_CARG_FC32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ABS_FC32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_CREAL_FC64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_CIMAG_FC64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_CARG_FC64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ABS_FC64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ISINF_FP32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ISINF_FP64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ISINF_FC32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ISINF_FC64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ISNAN_FP32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ISNAN_FP64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ISNAN_FC32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ISNAN_FC64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ISFINITE_FP32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ISFINITE_FP64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ISFINITE_FC32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_ISFINITE_FC64: GrB_UnaryOp;
}
pub type GxB_unary_function = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void, arg2: *const ::std::os::raw::c_void),
>;
extern "C" {
    pub fn GrB_UnaryOp_new(
        unaryop: *mut GrB_UnaryOp,
        function: GxB_unary_function,
        ztype: GrB_Type,
        xtype: GrB_Type,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_UnaryOp_new(
        unaryop: *mut GrB_UnaryOp,
        function: GxB_unary_function,
        ztype: GrB_Type,
        xtype: GrB_Type,
        unop_name: *const ::std::os::raw::c_char,
        unop_defn: *const ::std::os::raw::c_char,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_UnaryOp_ztype(ztype: *mut GrB_Type, unaryop: GrB_UnaryOp) -> GrB_Info;
}
extern "C" {
    pub fn GxB_UnaryOp_ztype_name(
        type_name: *mut ::std::os::raw::c_char,
        unaryop: GrB_UnaryOp,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_UnaryOp_xtype(xtype: *mut GrB_Type, unaryop: GrB_UnaryOp) -> GrB_Info;
}
extern "C" {
    pub fn GxB_UnaryOp_xtype_name(
        type_name: *mut ::std::os::raw::c_char,
        unaryop: GrB_UnaryOp,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_UnaryOp_free(unaryop: *mut GrB_UnaryOp) -> GrB_Info;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_BinaryOp_opaque {
    _unused: [u8; 0],
}
pub type GrB_BinaryOp = *mut GB_BinaryOp_opaque;
extern "C" {
    pub static mut GrB_FIRST_BOOL: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_SECOND_BOOL: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_ONEB_BOOL: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_POW_BOOL: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_FIRST_INT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_SECOND_INT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_ONEB_INT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_POW_INT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_FIRST_INT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_SECOND_INT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_ONEB_INT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_POW_INT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_FIRST_INT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_SECOND_INT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_ONEB_INT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_POW_INT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_FIRST_INT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_SECOND_INT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_ONEB_INT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_POW_INT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_FIRST_UINT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_SECOND_UINT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_ONEB_UINT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_POW_UINT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_FIRST_UINT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_SECOND_UINT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_ONEB_UINT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_POW_UINT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_FIRST_UINT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_SECOND_UINT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_ONEB_UINT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_POW_UINT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_FIRST_UINT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_SECOND_UINT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_ONEB_UINT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_POW_UINT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_FIRST_FP32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_SECOND_FP32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_ONEB_FP32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_POW_FP32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_FIRST_FP64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_SECOND_FP64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_ONEB_FP64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_POW_FP64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_FIRST_FC32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_SECOND_FC32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ONEB_FC32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_POW_FC32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_FIRST_FC64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_SECOND_FC64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ONEB_FC64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_POW_FC64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_PLUS_BOOL: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_MINUS_BOOL: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_TIMES_BOOL: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_DIV_BOOL: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_PLUS_INT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_MINUS_INT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_TIMES_INT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_DIV_INT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_PLUS_INT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_MINUS_INT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_TIMES_INT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_DIV_INT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_PLUS_INT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_MINUS_INT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_TIMES_INT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_DIV_INT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_PLUS_INT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_MINUS_INT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_TIMES_INT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_DIV_INT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_PLUS_UINT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_MINUS_UINT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_TIMES_UINT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_DIV_UINT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_PLUS_UINT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_MINUS_UINT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_TIMES_UINT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_DIV_UINT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_PLUS_UINT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_MINUS_UINT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_TIMES_UINT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_DIV_UINT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_PLUS_UINT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_MINUS_UINT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_TIMES_UINT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_DIV_UINT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_PLUS_FP32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_MINUS_FP32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_TIMES_FP32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_DIV_FP32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_PLUS_FP64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_MINUS_FP64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_TIMES_FP64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_DIV_FP64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_PLUS_FC32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_MINUS_FC32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_TIMES_FC32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_DIV_FC32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_PLUS_FC64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_MINUS_FC64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_TIMES_FC64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_DIV_FC64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_RMINUS_BOOL: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_RDIV_BOOL: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_PAIR_BOOL: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ANY_BOOL: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_RMINUS_INT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_RDIV_INT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_PAIR_INT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ANY_INT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_RMINUS_INT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_RDIV_INT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_PAIR_INT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ANY_INT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_RMINUS_INT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_RDIV_INT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_PAIR_INT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ANY_INT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_RMINUS_INT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_RDIV_INT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_PAIR_INT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ANY_INT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_RMINUS_UINT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_RDIV_UINT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_PAIR_UINT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ANY_UINT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_RMINUS_UINT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_RDIV_UINT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_PAIR_UINT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ANY_UINT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_RMINUS_UINT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_RDIV_UINT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_PAIR_UINT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ANY_UINT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_RMINUS_UINT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_RDIV_UINT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_PAIR_UINT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ANY_UINT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_RMINUS_FP32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_RDIV_FP32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_PAIR_FP32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ANY_FP32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_RMINUS_FP64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_RDIV_FP64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_PAIR_FP64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ANY_FP64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_RMINUS_FC32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_RDIV_FC32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_PAIR_FC32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ANY_FC32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_RMINUS_FC64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_RDIV_FC64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_PAIR_FC64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ANY_FC64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISEQ_BOOL: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISNE_BOOL: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISEQ_INT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISNE_INT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISEQ_INT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISNE_INT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISEQ_INT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISNE_INT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISEQ_INT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISNE_INT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISEQ_UINT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISNE_UINT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISEQ_UINT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISNE_UINT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISEQ_UINT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISNE_UINT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISEQ_UINT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISNE_UINT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISEQ_FP32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISNE_FP32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISEQ_FP64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISNE_FP64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISEQ_FC32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISNE_FC32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISEQ_FC64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISNE_FC64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISGT_BOOL: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISLT_BOOL: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISGE_BOOL: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISLE_BOOL: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISGT_INT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISLT_INT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISGE_INT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISLE_INT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISGT_INT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISLT_INT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISGE_INT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISLE_INT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISGT_INT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISLT_INT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISGE_INT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISLE_INT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISGT_INT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISLT_INT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISGE_INT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISLE_INT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISGT_UINT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISLT_UINT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISGE_UINT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISLE_UINT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISGT_UINT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISLT_UINT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISGE_UINT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISLE_UINT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISGT_UINT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISLT_UINT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISGE_UINT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISLE_UINT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISGT_UINT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISLT_UINT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISGE_UINT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISLE_UINT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISGT_FP32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISLT_FP32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISGE_FP32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISLE_FP32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISGT_FP64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISLT_FP64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISGE_FP64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ISLE_FP64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_MIN_BOOL: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_MAX_BOOL: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_MIN_INT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_MAX_INT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_MIN_INT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_MAX_INT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_MIN_INT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_MAX_INT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_MIN_INT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_MAX_INT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_MIN_UINT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_MAX_UINT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_MIN_UINT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_MAX_UINT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_MIN_UINT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_MAX_UINT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_MIN_UINT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_MAX_UINT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_MIN_FP32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_MAX_FP32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_MIN_FP64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_MAX_FP64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_LOR_BOOL: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_LAND_BOOL: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_LXOR_BOOL: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_LOR_INT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_LAND_INT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_LXOR_INT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_LOR_INT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_LAND_INT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_LXOR_INT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_LOR_INT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_LAND_INT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_LXOR_INT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_LOR_INT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_LAND_INT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_LXOR_INT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_LOR_UINT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_LAND_UINT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_LXOR_UINT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_LOR_UINT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_LAND_UINT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_LXOR_UINT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_LOR_UINT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_LAND_UINT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_LXOR_UINT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_LOR_UINT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_LAND_UINT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_LXOR_UINT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_LOR_FP32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_LAND_FP32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_LXOR_FP32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_LOR_FP64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_LAND_FP64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_LXOR_FP64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_LOR: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_LAND: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_LXOR: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_LXNOR: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ATAN2_FP32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_HYPOT_FP32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_FMOD_FP32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_REMAINDER_FP32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_ATAN2_FP64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_HYPOT_FP64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_FMOD_FP64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_REMAINDER_FP64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_LDEXP_FP32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_COPYSIGN_FP32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_LDEXP_FP64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_COPYSIGN_FP64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_BOR_INT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_BAND_INT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_BXOR_INT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_BXNOR_INT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_BOR_INT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_BAND_INT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_BXOR_INT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_BXNOR_INT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_BOR_INT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_BAND_INT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_BXOR_INT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_BXNOR_INT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_BOR_INT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_BAND_INT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_BXOR_INT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_BXNOR_INT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_BOR_UINT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_BAND_UINT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_BXOR_UINT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_BXNOR_UINT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_BOR_UINT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_BAND_UINT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_BXOR_UINT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_BXNOR_UINT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_BOR_UINT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_BAND_UINT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_BXOR_UINT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_BXNOR_UINT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_BOR_UINT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_BAND_UINT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_BXOR_UINT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_BXNOR_UINT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_BGET_INT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_BSET_INT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_BCLR_INT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_BGET_INT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_BSET_INT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_BCLR_INT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_BGET_INT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_BSET_INT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_BCLR_INT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_BGET_INT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_BSET_INT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_BCLR_INT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_BGET_UINT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_BSET_UINT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_BCLR_UINT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_BGET_UINT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_BSET_UINT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_BCLR_UINT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_BGET_UINT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_BSET_UINT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_BCLR_UINT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_BGET_UINT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_BSET_UINT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_BCLR_UINT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_BSHIFT_INT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_BSHIFT_INT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_BSHIFT_INT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_BSHIFT_INT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_BSHIFT_UINT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_BSHIFT_UINT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_BSHIFT_UINT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_BSHIFT_UINT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_EQ_BOOL: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_NE_BOOL: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_GT_BOOL: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_LT_BOOL: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_EQ_INT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_NE_INT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_GT_INT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_LT_INT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_EQ_INT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_NE_INT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_GT_INT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_LT_INT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_EQ_INT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_NE_INT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_GT_INT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_LT_INT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_EQ_INT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_NE_INT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_GT_INT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_LT_INT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_EQ_UINT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_NE_UINT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_GT_UINT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_LT_UINT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_EQ_UINT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_NE_UINT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_GT_UINT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_LT_UINT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_EQ_UINT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_NE_UINT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_GT_UINT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_LT_UINT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_EQ_UINT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_NE_UINT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_GT_UINT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_LT_UINT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_EQ_FP32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_NE_FP32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_GT_FP32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_LT_FP32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_EQ_FP64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_NE_FP64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_GT_FP64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_LT_FP64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_EQ_FC32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_NE_FC32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_EQ_FC64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_NE_FC64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_GE_BOOL: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_LE_BOOL: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_GE_INT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_LE_INT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_GE_INT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_LE_INT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_GE_INT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_LE_INT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_GE_INT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_LE_INT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_GE_UINT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_LE_UINT8: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_GE_UINT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_LE_UINT16: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_GE_UINT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_LE_UINT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_GE_UINT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_LE_UINT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_GE_FP32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_LE_FP32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_GE_FP64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GrB_LE_FP64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_CMPLX_FP32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_CMPLX_FP64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_FIRSTI_INT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_FIRSTI_INT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_FIRSTI1_INT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_FIRSTI1_INT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_FIRSTJ_INT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_FIRSTJ_INT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_FIRSTJ1_INT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_FIRSTJ1_INT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_SECONDI_INT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_SECONDI_INT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_SECONDI1_INT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_SECONDI1_INT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_SECONDJ_INT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_SECONDJ_INT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_SECONDJ1_INT32: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_SECONDJ1_INT64: GrB_BinaryOp;
}
extern "C" {
    pub static mut GxB_POSITIONI_INT32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_POSITIONI_INT64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_POSITIONI1_INT32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_POSITIONI1_INT64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_POSITIONJ_INT32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_POSITIONJ_INT64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_POSITIONJ1_INT32: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_POSITIONJ1_INT64: GrB_UnaryOp;
}
extern "C" {
    pub static mut GxB_IGNORE_DUP: GrB_BinaryOp;
}
pub type GxB_binary_function = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
        arg3: *const ::std::os::raw::c_void,
    ),
>;
extern "C" {
    pub fn GrB_BinaryOp_new(
        binaryop: *mut GrB_BinaryOp,
        function: GxB_binary_function,
        ztype: GrB_Type,
        xtype: GrB_Type,
        ytype: GrB_Type,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_BinaryOp_new(
        op: *mut GrB_BinaryOp,
        function: GxB_binary_function,
        ztype: GrB_Type,
        xtype: GrB_Type,
        ytype: GrB_Type,
        binop_name: *const ::std::os::raw::c_char,
        binop_defn: *const ::std::os::raw::c_char,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_BinaryOp_ztype(ztype: *mut GrB_Type, op: GrB_BinaryOp) -> GrB_Info;
}
extern "C" {
    pub fn GxB_BinaryOp_ztype_name(
        type_name: *mut ::std::os::raw::c_char,
        op: GrB_BinaryOp,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_BinaryOp_xtype(xtype: *mut GrB_Type, op: GrB_BinaryOp) -> GrB_Info;
}
extern "C" {
    pub fn GxB_BinaryOp_xtype_name(
        type_name: *mut ::std::os::raw::c_char,
        op: GrB_BinaryOp,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_BinaryOp_ytype(ytype: *mut GrB_Type, op: GrB_BinaryOp) -> GrB_Info;
}
extern "C" {
    pub fn GxB_BinaryOp_ytype_name(
        type_name: *mut ::std::os::raw::c_char,
        op: GrB_BinaryOp,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_BinaryOp_free(binaryop: *mut GrB_BinaryOp) -> GrB_Info;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_SelectOp_opaque {
    _unused: [u8; 0],
}
pub type GxB_SelectOp = *mut GB_SelectOp_opaque;
extern "C" {
    pub static mut GxB_TRIL: GxB_SelectOp;
}
extern "C" {
    pub static mut GxB_TRIU: GxB_SelectOp;
}
extern "C" {
    pub static mut GxB_DIAG: GxB_SelectOp;
}
extern "C" {
    pub static mut GxB_OFFDIAG: GxB_SelectOp;
}
extern "C" {
    pub static mut GxB_NONZERO: GxB_SelectOp;
}
extern "C" {
    pub static mut GxB_EQ_ZERO: GxB_SelectOp;
}
extern "C" {
    pub static mut GxB_GT_ZERO: GxB_SelectOp;
}
extern "C" {
    pub static mut GxB_GE_ZERO: GxB_SelectOp;
}
extern "C" {
    pub static mut GxB_LT_ZERO: GxB_SelectOp;
}
extern "C" {
    pub static mut GxB_LE_ZERO: GxB_SelectOp;
}
extern "C" {
    pub static mut GxB_NE_THUNK: GxB_SelectOp;
}
extern "C" {
    pub static mut GxB_EQ_THUNK: GxB_SelectOp;
}
extern "C" {
    pub static mut GxB_GT_THUNK: GxB_SelectOp;
}
extern "C" {
    pub static mut GxB_GE_THUNK: GxB_SelectOp;
}
extern "C" {
    pub static mut GxB_LT_THUNK: GxB_SelectOp;
}
extern "C" {
    pub static mut GxB_LE_THUNK: GxB_SelectOp;
}
extern "C" {
    pub fn GxB_SelectOp_xtype(xtype: *mut GrB_Type, selectop: GxB_SelectOp) -> GrB_Info;
}
extern "C" {
    pub fn GxB_SelectOp_ttype(ttype: *mut GrB_Type, selectop: GxB_SelectOp) -> GrB_Info;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_IndexUnaryOp_opaque {
    _unused: [u8; 0],
}
pub type GrB_IndexUnaryOp = *mut GB_IndexUnaryOp_opaque;
pub type GxB_index_unary_function = ::std::option::Option<
    unsafe extern "C" fn(
        z: *mut ::std::os::raw::c_void,
        x: *const ::std::os::raw::c_void,
        i: GrB_Index,
        j: GrB_Index,
        y: *const ::std::os::raw::c_void,
    ),
>;
extern "C" {
    pub fn GrB_IndexUnaryOp_new(
        op: *mut GrB_IndexUnaryOp,
        function: GxB_index_unary_function,
        ztype: GrB_Type,
        xtype: GrB_Type,
        ytype: GrB_Type,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_IndexUnaryOp_new(
        op: *mut GrB_IndexUnaryOp,
        function: GxB_index_unary_function,
        ztype: GrB_Type,
        xtype: GrB_Type,
        ytype: GrB_Type,
        idxop_name: *const ::std::os::raw::c_char,
        idxop_defn: *const ::std::os::raw::c_char,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_IndexUnaryOp_ztype_name(
        arg1: *mut ::std::os::raw::c_char,
        op: GrB_IndexUnaryOp,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_IndexUnaryOp_xtype_name(
        arg1: *mut ::std::os::raw::c_char,
        op: GrB_IndexUnaryOp,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_IndexUnaryOp_ytype_name(
        arg1: *mut ::std::os::raw::c_char,
        op: GrB_IndexUnaryOp,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_IndexUnaryOp_free(op: *mut GrB_IndexUnaryOp) -> GrB_Info;
}
extern "C" {
    pub static mut GrB_ROWINDEX_INT32: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_ROWINDEX_INT64: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_COLINDEX_INT32: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_COLINDEX_INT64: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_DIAGINDEX_INT32: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_DIAGINDEX_INT64: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_TRIL: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_TRIU: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_DIAG: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_OFFDIAG: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_COLLE: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_COLGT: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_ROWLE: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_ROWGT: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUEEQ_INT8: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUEEQ_UINT8: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUEEQ_FP32: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUEEQ_BOOL: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUEEQ_INT16: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUEEQ_UINT16: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUEEQ_FP64: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUEEQ_INT32: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUEEQ_UINT32: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GxB_VALUEEQ_FC32: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUEEQ_INT64: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUEEQ_UINT64: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GxB_VALUEEQ_FC64: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUENE_INT8: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUENE_UINT8: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUENE_FP32: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUENE_BOOL: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUENE_INT16: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUENE_UINT16: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUENE_FP64: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUENE_INT32: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUENE_UINT32: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GxB_VALUENE_FC32: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUENE_INT64: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUENE_UINT64: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GxB_VALUENE_FC64: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUELT_INT8: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUELT_UINT8: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUELT_FP32: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUELT_BOOL: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUELT_INT16: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUELT_UINT16: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUELT_FP64: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUELT_INT32: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUELT_UINT32: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUELT_INT64: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUELT_UINT64: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUELE_INT8: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUELE_UINT8: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUELE_FP32: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUELE_BOOL: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUELE_INT16: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUELE_UINT16: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUELE_FP64: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUELE_INT32: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUELE_UINT32: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUELE_INT64: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUELE_UINT64: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUEGT_INT8: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUEGT_UINT8: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUEGT_FP32: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUEGT_BOOL: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUEGT_INT16: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUEGT_UINT16: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUEGT_FP64: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUEGT_INT32: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUEGT_UINT32: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUEGT_INT64: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUEGT_UINT64: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUEGE_INT8: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUEGE_UINT8: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUEGE_FP32: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUEGE_BOOL: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUEGE_INT16: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUEGE_UINT16: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUEGE_FP64: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUEGE_INT32: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUEGE_UINT32: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUEGE_INT64: GrB_IndexUnaryOp;
}
extern "C" {
    pub static mut GrB_VALUEGE_UINT64: GrB_IndexUnaryOp;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_Monoid_opaque {
    _unused: [u8; 0],
}
pub type GrB_Monoid = *mut GB_Monoid_opaque;
extern "C" {
    pub fn GrB_Monoid_new_BOOL(
        monoid: *mut GrB_Monoid,
        op: GrB_BinaryOp,
        identity: bool,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Monoid_new_INT8(monoid: *mut GrB_Monoid, op: GrB_BinaryOp, identity: i8)
        -> GrB_Info;
}
extern "C" {
    pub fn GrB_Monoid_new_UINT8(
        monoid: *mut GrB_Monoid,
        op: GrB_BinaryOp,
        identity: u8,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Monoid_new_INT16(
        monoid: *mut GrB_Monoid,
        op: GrB_BinaryOp,
        identity: i16,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Monoid_new_UINT16(
        monoid: *mut GrB_Monoid,
        op: GrB_BinaryOp,
        identity: u16,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Monoid_new_INT32(
        monoid: *mut GrB_Monoid,
        op: GrB_BinaryOp,
        identity: i32,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Monoid_new_UINT32(
        monoid: *mut GrB_Monoid,
        op: GrB_BinaryOp,
        identity: u32,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Monoid_new_INT64(
        monoid: *mut GrB_Monoid,
        op: GrB_BinaryOp,
        identity: i64,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Monoid_new_UINT64(
        monoid: *mut GrB_Monoid,
        op: GrB_BinaryOp,
        identity: u64,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Monoid_new_FP32(
        monoid: *mut GrB_Monoid,
        op: GrB_BinaryOp,
        identity: f32,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Monoid_new_FP64(
        monoid: *mut GrB_Monoid,
        op: GrB_BinaryOp,
        identity: f64,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Monoid_new_FC32(
        monoid: *mut GrB_Monoid,
        op: GrB_BinaryOp,
        identity: GxB_FC32_t,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Monoid_new_FC64(
        monoid: *mut GrB_Monoid,
        op: GrB_BinaryOp,
        identity: GxB_FC64_t,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Monoid_new_UDT(
        monoid: *mut GrB_Monoid,
        op: GrB_BinaryOp,
        identity: *mut ::std::os::raw::c_void,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Monoid_terminal_new_BOOL(
        monoid: *mut GrB_Monoid,
        op: GrB_BinaryOp,
        identity: bool,
        terminal: bool,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Monoid_terminal_new_INT8(
        monoid: *mut GrB_Monoid,
        op: GrB_BinaryOp,
        identity: i8,
        terminal: i8,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Monoid_terminal_new_UINT8(
        monoid: *mut GrB_Monoid,
        op: GrB_BinaryOp,
        identity: u8,
        terminal: u8,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Monoid_terminal_new_INT16(
        monoid: *mut GrB_Monoid,
        op: GrB_BinaryOp,
        identity: i16,
        terminal: i16,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Monoid_terminal_new_UINT16(
        monoid: *mut GrB_Monoid,
        op: GrB_BinaryOp,
        identity: u16,
        terminal: u16,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Monoid_terminal_new_INT32(
        monoid: *mut GrB_Monoid,
        op: GrB_BinaryOp,
        identity: i32,
        terminal: i32,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Monoid_terminal_new_UINT32(
        monoid: *mut GrB_Monoid,
        op: GrB_BinaryOp,
        identity: u32,
        terminal: u32,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Monoid_terminal_new_INT64(
        monoid: *mut GrB_Monoid,
        op: GrB_BinaryOp,
        identity: i64,
        terminal: i64,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Monoid_terminal_new_UINT64(
        monoid: *mut GrB_Monoid,
        op: GrB_BinaryOp,
        identity: u64,
        terminal: u64,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Monoid_terminal_new_FP32(
        monoid: *mut GrB_Monoid,
        op: GrB_BinaryOp,
        identity: f32,
        terminal: f32,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Monoid_terminal_new_FP64(
        monoid: *mut GrB_Monoid,
        op: GrB_BinaryOp,
        identity: f64,
        terminal: f64,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Monoid_terminal_new_FC32(
        monoid: *mut GrB_Monoid,
        op: GrB_BinaryOp,
        identity: GxB_FC32_t,
        terminal: GxB_FC32_t,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Monoid_terminal_new_FC64(
        monoid: *mut GrB_Monoid,
        op: GrB_BinaryOp,
        identity: GxB_FC64_t,
        terminal: GxB_FC64_t,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Monoid_terminal_new_UDT(
        monoid: *mut GrB_Monoid,
        op: GrB_BinaryOp,
        identity: *mut ::std::os::raw::c_void,
        terminal: *mut ::std::os::raw::c_void,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Monoid_operator(op: *mut GrB_BinaryOp, monoid: GrB_Monoid) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Monoid_identity(
        identity: *mut ::std::os::raw::c_void,
        monoid: GrB_Monoid,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Monoid_terminal(
        arg1: *mut bool,
        terminal: *mut ::std::os::raw::c_void,
        monoid: GrB_Monoid,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Monoid_free(monoid: *mut GrB_Monoid) -> GrB_Info;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_Semiring_opaque {
    _unused: [u8; 0],
}
pub type GrB_Semiring = *mut GB_Semiring_opaque;
extern "C" {
    pub fn GrB_Semiring_new(
        semiring: *mut GrB_Semiring,
        add: GrB_Monoid,
        multiply: GrB_BinaryOp,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Semiring_add(add: *mut GrB_Monoid, semiring: GrB_Semiring) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Semiring_multiply(multiply: *mut GrB_BinaryOp, semiring: GrB_Semiring) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Semiring_free(semiring: *mut GrB_Semiring) -> GrB_Info;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_Scalar_opaque {
    _unused: [u8; 0],
}
pub type GxB_Scalar = *mut GB_Scalar_opaque;
pub type GrB_Scalar = *mut GB_Scalar_opaque;
extern "C" {
    pub fn GrB_Scalar_new(s: *mut GrB_Scalar, type_: GrB_Type) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Scalar_dup(s: *mut GrB_Scalar, t: GrB_Scalar) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Scalar_clear(s: GrB_Scalar) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Scalar_nvals(nvals: *mut GrB_Index, s: GrB_Scalar) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Scalar_type(type_: *mut GrB_Type, s: GrB_Scalar) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Scalar_type_name(type_name: *mut ::std::os::raw::c_char, s: GrB_Scalar) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Scalar_memoryUsage(size: *mut usize, s: GrB_Scalar) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Scalar_free(s: *mut GrB_Scalar) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Scalar_new(s: *mut GrB_Scalar, type_: GrB_Type) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Scalar_dup(s: *mut GrB_Scalar, t: GrB_Scalar) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Scalar_clear(s: GrB_Scalar) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Scalar_nvals(nvals: *mut GrB_Index, s: GrB_Scalar) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Scalar_free(s: *mut GrB_Scalar) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Scalar_setElement_BOOL(s: GrB_Scalar, x: bool) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Scalar_setElement_INT8(s: GrB_Scalar, x: i8) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Scalar_setElement_UINT8(s: GrB_Scalar, x: u8) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Scalar_setElement_INT16(s: GrB_Scalar, x: i16) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Scalar_setElement_UINT16(s: GrB_Scalar, x: u16) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Scalar_setElement_INT32(s: GrB_Scalar, x: i32) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Scalar_setElement_UINT32(s: GrB_Scalar, x: u32) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Scalar_setElement_INT64(s: GrB_Scalar, x: i64) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Scalar_setElement_UINT64(s: GrB_Scalar, x: u64) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Scalar_setElement_FP32(s: GrB_Scalar, x: f32) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Scalar_setElement_FP64(s: GrB_Scalar, x: f64) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Scalar_setElement_FC32(s: GrB_Scalar, x: GxB_FC32_t) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Scalar_setElement_FC64(s: GrB_Scalar, x: GxB_FC64_t) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Scalar_setElement_UDT(s: GrB_Scalar, x: *mut ::std::os::raw::c_void) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Scalar_setElement_BOOL(s: GrB_Scalar, x: bool) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Scalar_setElement_INT8(s: GrB_Scalar, x: i8) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Scalar_setElement_INT16(s: GrB_Scalar, x: i16) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Scalar_setElement_INT32(s: GrB_Scalar, x: i32) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Scalar_setElement_INT64(s: GrB_Scalar, x: i64) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Scalar_setElement_UINT8(s: GrB_Scalar, x: u8) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Scalar_setElement_UINT16(s: GrB_Scalar, x: u16) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Scalar_setElement_UINT32(s: GrB_Scalar, x: u32) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Scalar_setElement_UINT64(s: GrB_Scalar, x: u64) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Scalar_setElement_FP32(s: GrB_Scalar, x: f32) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Scalar_setElement_FP64(s: GrB_Scalar, x: f64) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Scalar_setElement_UDT(s: GrB_Scalar, x: *mut ::std::os::raw::c_void) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Scalar_extractElement_BOOL(x: *mut bool, s: GrB_Scalar) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Scalar_extractElement_INT8(x: *mut i8, s: GrB_Scalar) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Scalar_extractElement_UINT8(x: *mut u8, s: GrB_Scalar) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Scalar_extractElement_INT16(x: *mut i16, s: GrB_Scalar) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Scalar_extractElement_UINT16(x: *mut u16, s: GrB_Scalar) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Scalar_extractElement_INT32(x: *mut i32, s: GrB_Scalar) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Scalar_extractElement_UINT32(x: *mut u32, s: GrB_Scalar) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Scalar_extractElement_INT64(x: *mut i64, s: GrB_Scalar) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Scalar_extractElement_UINT64(x: *mut u64, s: GrB_Scalar) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Scalar_extractElement_FP32(x: *mut f32, s: GrB_Scalar) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Scalar_extractElement_FP64(x: *mut f64, s: GrB_Scalar) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Scalar_extractElement_FC32(x: *mut GxB_FC32_t, s: GrB_Scalar) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Scalar_extractElement_FC64(x: *mut GxB_FC64_t, s: GrB_Scalar) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Scalar_extractElement_UDT(x: *mut ::std::os::raw::c_void, s: GrB_Scalar)
        -> GrB_Info;
}
extern "C" {
    pub fn GxB_Scalar_extractElement_BOOL(x: *mut bool, s: GrB_Scalar) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Scalar_extractElement_INT8(x: *mut i8, s: GrB_Scalar) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Scalar_extractElement_INT16(x: *mut i16, s: GrB_Scalar) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Scalar_extractElement_INT32(x: *mut i32, s: GrB_Scalar) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Scalar_extractElement_INT64(x: *mut i64, s: GrB_Scalar) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Scalar_extractElement_UINT8(x: *mut u8, s: GrB_Scalar) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Scalar_extractElement_UINT16(x: *mut u16, s: GrB_Scalar) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Scalar_extractElement_UINT32(x: *mut u32, s: GrB_Scalar) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Scalar_extractElement_UINT64(x: *mut u64, s: GrB_Scalar) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Scalar_extractElement_FP32(x: *mut f32, s: GrB_Scalar) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Scalar_extractElement_FP64(x: *mut f64, s: GrB_Scalar) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Scalar_extractElement_UDT(x: *mut ::std::os::raw::c_void, s: GrB_Scalar)
        -> GrB_Info;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_Vector_opaque {
    _unused: [u8; 0],
}
pub type GrB_Vector = *mut GB_Vector_opaque;
extern "C" {
    pub fn GrB_Vector_new(v: *mut GrB_Vector, type_: GrB_Type, n: GrB_Index) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_dup(w: *mut GrB_Vector, u: GrB_Vector) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_clear(v: GrB_Vector) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_size(n: *mut GrB_Index, v: GrB_Vector) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_nvals(nvals: *mut GrB_Index, v: GrB_Vector) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Vector_type(type_: *mut GrB_Type, v: GrB_Vector) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Vector_type_name(type_name: *mut ::std::os::raw::c_char, v: GrB_Vector) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Vector_memoryUsage(size: *mut usize, v: GrB_Vector) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Vector_iso(iso: *mut bool, v: GrB_Vector) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_free(v: *mut GrB_Vector) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_build_BOOL(
        w: GrB_Vector,
        I: *const GrB_Index,
        X: *const bool,
        nvals: GrB_Index,
        dup: GrB_BinaryOp,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_build_INT8(
        w: GrB_Vector,
        I: *const GrB_Index,
        X: *const i8,
        nvals: GrB_Index,
        dup: GrB_BinaryOp,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_build_UINT8(
        w: GrB_Vector,
        I: *const GrB_Index,
        X: *const u8,
        nvals: GrB_Index,
        dup: GrB_BinaryOp,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_build_INT16(
        w: GrB_Vector,
        I: *const GrB_Index,
        X: *const i16,
        nvals: GrB_Index,
        dup: GrB_BinaryOp,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_build_UINT16(
        w: GrB_Vector,
        I: *const GrB_Index,
        X: *const u16,
        nvals: GrB_Index,
        dup: GrB_BinaryOp,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_build_INT32(
        w: GrB_Vector,
        I: *const GrB_Index,
        X: *const i32,
        nvals: GrB_Index,
        dup: GrB_BinaryOp,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_build_UINT32(
        w: GrB_Vector,
        I: *const GrB_Index,
        X: *const u32,
        nvals: GrB_Index,
        dup: GrB_BinaryOp,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_build_INT64(
        w: GrB_Vector,
        I: *const GrB_Index,
        X: *const i64,
        nvals: GrB_Index,
        dup: GrB_BinaryOp,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_build_UINT64(
        w: GrB_Vector,
        I: *const GrB_Index,
        X: *const u64,
        nvals: GrB_Index,
        dup: GrB_BinaryOp,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_build_FP32(
        w: GrB_Vector,
        I: *const GrB_Index,
        X: *const f32,
        nvals: GrB_Index,
        dup: GrB_BinaryOp,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_build_FP64(
        w: GrB_Vector,
        I: *const GrB_Index,
        X: *const f64,
        nvals: GrB_Index,
        dup: GrB_BinaryOp,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Vector_build_FC32(
        w: GrB_Vector,
        I: *const GrB_Index,
        X: *const GxB_FC32_t,
        nvals: GrB_Index,
        dup: GrB_BinaryOp,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Vector_build_FC64(
        w: GrB_Vector,
        I: *const GrB_Index,
        X: *const GxB_FC64_t,
        nvals: GrB_Index,
        dup: GrB_BinaryOp,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_build_UDT(
        w: GrB_Vector,
        I: *const GrB_Index,
        X: *const ::std::os::raw::c_void,
        nvals: GrB_Index,
        dup: GrB_BinaryOp,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Vector_build_Scalar(
        w: GrB_Vector,
        I: *const GrB_Index,
        scalar: GrB_Scalar,
        nvals: GrB_Index,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_setElement_BOOL(w: GrB_Vector, x: bool, i: GrB_Index) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_setElement_INT8(w: GrB_Vector, x: i8, i: GrB_Index) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_setElement_UINT8(w: GrB_Vector, x: u8, i: GrB_Index) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_setElement_INT16(w: GrB_Vector, x: i16, i: GrB_Index) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_setElement_UINT16(w: GrB_Vector, x: u16, i: GrB_Index) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_setElement_INT32(w: GrB_Vector, x: i32, i: GrB_Index) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_setElement_UINT32(w: GrB_Vector, x: u32, i: GrB_Index) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_setElement_INT64(w: GrB_Vector, x: i64, i: GrB_Index) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_setElement_UINT64(w: GrB_Vector, x: u64, i: GrB_Index) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_setElement_FP32(w: GrB_Vector, x: f32, i: GrB_Index) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_setElement_FP64(w: GrB_Vector, x: f64, i: GrB_Index) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Vector_setElement_FC32(w: GrB_Vector, x: GxB_FC32_t, i: GrB_Index) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Vector_setElement_FC64(w: GrB_Vector, x: GxB_FC64_t, i: GrB_Index) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_setElement_UDT(
        w: GrB_Vector,
        x: *mut ::std::os::raw::c_void,
        i: GrB_Index,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_setElement_Scalar(w: GrB_Vector, x: GrB_Scalar, i: GrB_Index) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_extractElement_BOOL(x: *mut bool, v: GrB_Vector, i: GrB_Index) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_extractElement_INT8(x: *mut i8, v: GrB_Vector, i: GrB_Index) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_extractElement_UINT8(x: *mut u8, v: GrB_Vector, i: GrB_Index) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_extractElement_INT16(x: *mut i16, v: GrB_Vector, i: GrB_Index) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_extractElement_UINT16(x: *mut u16, v: GrB_Vector, i: GrB_Index) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_extractElement_INT32(x: *mut i32, v: GrB_Vector, i: GrB_Index) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_extractElement_UINT32(x: *mut u32, v: GrB_Vector, i: GrB_Index) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_extractElement_INT64(x: *mut i64, v: GrB_Vector, i: GrB_Index) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_extractElement_UINT64(x: *mut u64, v: GrB_Vector, i: GrB_Index) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_extractElement_FP32(x: *mut f32, v: GrB_Vector, i: GrB_Index) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_extractElement_FP64(x: *mut f64, v: GrB_Vector, i: GrB_Index) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Vector_extractElement_FC32(
        x: *mut GxB_FC32_t,
        v: GrB_Vector,
        i: GrB_Index,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Vector_extractElement_FC64(
        x: *mut GxB_FC64_t,
        v: GrB_Vector,
        i: GrB_Index,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_extractElement_UDT(
        x: *mut ::std::os::raw::c_void,
        v: GrB_Vector,
        i: GrB_Index,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_extractElement_Scalar(x: GrB_Scalar, v: GrB_Vector, i: GrB_Index)
        -> GrB_Info;
}
extern "C" {
    pub fn GxB_Vector_isStoredElement(v: GrB_Vector, i: GrB_Index) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_removeElement(v: GrB_Vector, i: GrB_Index) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_extractTuples_BOOL(
        I: *mut GrB_Index,
        X: *mut bool,
        nvals: *mut GrB_Index,
        v: GrB_Vector,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_extractTuples_INT8(
        I: *mut GrB_Index,
        X: *mut i8,
        nvals: *mut GrB_Index,
        v: GrB_Vector,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_extractTuples_UINT8(
        I: *mut GrB_Index,
        X: *mut u8,
        nvals: *mut GrB_Index,
        v: GrB_Vector,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_extractTuples_INT16(
        I: *mut GrB_Index,
        X: *mut i16,
        nvals: *mut GrB_Index,
        v: GrB_Vector,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_extractTuples_UINT16(
        I: *mut GrB_Index,
        X: *mut u16,
        nvals: *mut GrB_Index,
        v: GrB_Vector,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_extractTuples_INT32(
        I: *mut GrB_Index,
        X: *mut i32,
        nvals: *mut GrB_Index,
        v: GrB_Vector,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_extractTuples_UINT32(
        I: *mut GrB_Index,
        X: *mut u32,
        nvals: *mut GrB_Index,
        v: GrB_Vector,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_extractTuples_INT64(
        I: *mut GrB_Index,
        X: *mut i64,
        nvals: *mut GrB_Index,
        v: GrB_Vector,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_extractTuples_UINT64(
        I: *mut GrB_Index,
        X: *mut u64,
        nvals: *mut GrB_Index,
        v: GrB_Vector,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_extractTuples_FP32(
        I: *mut GrB_Index,
        X: *mut f32,
        nvals: *mut GrB_Index,
        v: GrB_Vector,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_extractTuples_FP64(
        I: *mut GrB_Index,
        X: *mut f64,
        nvals: *mut GrB_Index,
        v: GrB_Vector,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Vector_extractTuples_FC32(
        I: *mut GrB_Index,
        X: *mut GxB_FC32_t,
        nvals: *mut GrB_Index,
        v: GrB_Vector,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Vector_extractTuples_FC64(
        I: *mut GrB_Index,
        X: *mut GxB_FC64_t,
        nvals: *mut GrB_Index,
        v: GrB_Vector,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_extractTuples_UDT(
        I: *mut GrB_Index,
        X: *mut ::std::os::raw::c_void,
        nvals: *mut GrB_Index,
        v: GrB_Vector,
    ) -> GrB_Info;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_Matrix_opaque {
    _unused: [u8; 0],
}
pub type GrB_Matrix = *mut GB_Matrix_opaque;
extern "C" {
    pub fn GrB_Matrix_new(
        A: *mut GrB_Matrix,
        type_: GrB_Type,
        nrows: GrB_Index,
        ncols: GrB_Index,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_dup(C: *mut GrB_Matrix, A: GrB_Matrix) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_clear(A: GrB_Matrix) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_nrows(nrows: *mut GrB_Index, A: GrB_Matrix) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_ncols(ncols: *mut GrB_Index, A: GrB_Matrix) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_nvals(nvals: *mut GrB_Index, A: GrB_Matrix) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Matrix_type(type_: *mut GrB_Type, A: GrB_Matrix) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Matrix_type_name(type_name: *mut ::std::os::raw::c_char, A: GrB_Matrix) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Matrix_memoryUsage(size: *mut usize, A: GrB_Matrix) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Matrix_iso(iso: *mut bool, A: GrB_Matrix) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_free(A: *mut GrB_Matrix) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_build_BOOL(
        C: GrB_Matrix,
        I: *const GrB_Index,
        J: *const GrB_Index,
        X: *const bool,
        nvals: GrB_Index,
        dup: GrB_BinaryOp,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_build_INT8(
        C: GrB_Matrix,
        I: *const GrB_Index,
        J: *const GrB_Index,
        X: *const i8,
        nvals: GrB_Index,
        dup: GrB_BinaryOp,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_build_UINT8(
        C: GrB_Matrix,
        I: *const GrB_Index,
        J: *const GrB_Index,
        X: *const u8,
        nvals: GrB_Index,
        dup: GrB_BinaryOp,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_build_INT16(
        C: GrB_Matrix,
        I: *const GrB_Index,
        J: *const GrB_Index,
        X: *const i16,
        nvals: GrB_Index,
        dup: GrB_BinaryOp,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_build_UINT16(
        C: GrB_Matrix,
        I: *const GrB_Index,
        J: *const GrB_Index,
        X: *const u16,
        nvals: GrB_Index,
        dup: GrB_BinaryOp,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_build_INT32(
        C: GrB_Matrix,
        I: *const GrB_Index,
        J: *const GrB_Index,
        X: *const i32,
        nvals: GrB_Index,
        dup: GrB_BinaryOp,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_build_UINT32(
        C: GrB_Matrix,
        I: *const GrB_Index,
        J: *const GrB_Index,
        X: *const u32,
        nvals: GrB_Index,
        dup: GrB_BinaryOp,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_build_INT64(
        C: GrB_Matrix,
        I: *const GrB_Index,
        J: *const GrB_Index,
        X: *const i64,
        nvals: GrB_Index,
        dup: GrB_BinaryOp,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_build_UINT64(
        C: GrB_Matrix,
        I: *const GrB_Index,
        J: *const GrB_Index,
        X: *const u64,
        nvals: GrB_Index,
        dup: GrB_BinaryOp,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_build_FP32(
        C: GrB_Matrix,
        I: *const GrB_Index,
        J: *const GrB_Index,
        X: *const f32,
        nvals: GrB_Index,
        dup: GrB_BinaryOp,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_build_FP64(
        C: GrB_Matrix,
        I: *const GrB_Index,
        J: *const GrB_Index,
        X: *const f64,
        nvals: GrB_Index,
        dup: GrB_BinaryOp,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Matrix_build_FC32(
        C: GrB_Matrix,
        I: *const GrB_Index,
        J: *const GrB_Index,
        X: *const GxB_FC32_t,
        nvals: GrB_Index,
        dup: GrB_BinaryOp,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Matrix_build_FC64(
        C: GrB_Matrix,
        I: *const GrB_Index,
        J: *const GrB_Index,
        X: *const GxB_FC64_t,
        nvals: GrB_Index,
        dup: GrB_BinaryOp,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_build_UDT(
        C: GrB_Matrix,
        I: *const GrB_Index,
        J: *const GrB_Index,
        X: *const ::std::os::raw::c_void,
        nvals: GrB_Index,
        dup: GrB_BinaryOp,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Matrix_build_Scalar(
        C: GrB_Matrix,
        I: *const GrB_Index,
        J: *const GrB_Index,
        scalar: GrB_Scalar,
        nvals: GrB_Index,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_setElement_BOOL(
        C: GrB_Matrix,
        x: bool,
        i: GrB_Index,
        j: GrB_Index,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_setElement_INT8(C: GrB_Matrix, x: i8, i: GrB_Index, j: GrB_Index)
        -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_setElement_UINT8(
        C: GrB_Matrix,
        x: u8,
        i: GrB_Index,
        j: GrB_Index,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_setElement_INT16(
        C: GrB_Matrix,
        x: i16,
        i: GrB_Index,
        j: GrB_Index,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_setElement_UINT16(
        C: GrB_Matrix,
        x: u16,
        i: GrB_Index,
        j: GrB_Index,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_setElement_INT32(
        C: GrB_Matrix,
        x: i32,
        i: GrB_Index,
        j: GrB_Index,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_setElement_UINT32(
        C: GrB_Matrix,
        x: u32,
        i: GrB_Index,
        j: GrB_Index,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_setElement_INT64(
        C: GrB_Matrix,
        x: i64,
        i: GrB_Index,
        j: GrB_Index,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_setElement_UINT64(
        C: GrB_Matrix,
        x: u64,
        i: GrB_Index,
        j: GrB_Index,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_setElement_FP32(
        C: GrB_Matrix,
        x: f32,
        i: GrB_Index,
        j: GrB_Index,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_setElement_FP64(
        C: GrB_Matrix,
        x: f64,
        i: GrB_Index,
        j: GrB_Index,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Matrix_setElement_FC32(
        C: GrB_Matrix,
        x: GxB_FC32_t,
        i: GrB_Index,
        j: GrB_Index,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Matrix_setElement_FC64(
        C: GrB_Matrix,
        x: GxB_FC64_t,
        i: GrB_Index,
        j: GrB_Index,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_setElement_UDT(
        C: GrB_Matrix,
        x: *mut ::std::os::raw::c_void,
        i: GrB_Index,
        j: GrB_Index,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_setElement_Scalar(
        C: GrB_Matrix,
        x: GrB_Scalar,
        i: GrB_Index,
        j: GrB_Index,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_extractElement_BOOL(
        x: *mut bool,
        A: GrB_Matrix,
        i: GrB_Index,
        j: GrB_Index,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_extractElement_INT8(
        x: *mut i8,
        A: GrB_Matrix,
        i: GrB_Index,
        j: GrB_Index,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_extractElement_UINT8(
        x: *mut u8,
        A: GrB_Matrix,
        i: GrB_Index,
        j: GrB_Index,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_extractElement_INT16(
        x: *mut i16,
        A: GrB_Matrix,
        i: GrB_Index,
        j: GrB_Index,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_extractElement_UINT16(
        x: *mut u16,
        A: GrB_Matrix,
        i: GrB_Index,
        j: GrB_Index,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_extractElement_INT32(
        x: *mut i32,
        A: GrB_Matrix,
        i: GrB_Index,
        j: GrB_Index,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_extractElement_UINT32(
        x: *mut u32,
        A: GrB_Matrix,
        i: GrB_Index,
        j: GrB_Index,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_extractElement_INT64(
        x: *mut i64,
        A: GrB_Matrix,
        i: GrB_Index,
        j: GrB_Index,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_extractElement_UINT64(
        x: *mut u64,
        A: GrB_Matrix,
        i: GrB_Index,
        j: GrB_Index,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_extractElement_FP32(
        x: *mut f32,
        A: GrB_Matrix,
        i: GrB_Index,
        j: GrB_Index,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_extractElement_FP64(
        x: *mut f64,
        A: GrB_Matrix,
        i: GrB_Index,
        j: GrB_Index,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Matrix_extractElement_FC32(
        x: *mut GxB_FC32_t,
        A: GrB_Matrix,
        i: GrB_Index,
        j: GrB_Index,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Matrix_extractElement_FC64(
        x: *mut GxB_FC64_t,
        A: GrB_Matrix,
        i: GrB_Index,
        j: GrB_Index,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_extractElement_UDT(
        x: *mut ::std::os::raw::c_void,
        A: GrB_Matrix,
        i: GrB_Index,
        j: GrB_Index,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_extractElement_Scalar(
        x: GrB_Scalar,
        A: GrB_Matrix,
        i: GrB_Index,
        j: GrB_Index,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Matrix_isStoredElement(A: GrB_Matrix, i: GrB_Index, j: GrB_Index) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_removeElement(C: GrB_Matrix, i: GrB_Index, j: GrB_Index) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_extractTuples_BOOL(
        I: *mut GrB_Index,
        J: *mut GrB_Index,
        X: *mut bool,
        nvals: *mut GrB_Index,
        A: GrB_Matrix,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_extractTuples_INT8(
        I: *mut GrB_Index,
        J: *mut GrB_Index,
        X: *mut i8,
        nvals: *mut GrB_Index,
        A: GrB_Matrix,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_extractTuples_UINT8(
        I: *mut GrB_Index,
        J: *mut GrB_Index,
        X: *mut u8,
        nvals: *mut GrB_Index,
        A: GrB_Matrix,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_extractTuples_INT16(
        I: *mut GrB_Index,
        J: *mut GrB_Index,
        X: *mut i16,
        nvals: *mut GrB_Index,
        A: GrB_Matrix,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_extractTuples_UINT16(
        I: *mut GrB_Index,
        J: *mut GrB_Index,
        X: *mut u16,
        nvals: *mut GrB_Index,
        A: GrB_Matrix,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_extractTuples_INT32(
        I: *mut GrB_Index,
        J: *mut GrB_Index,
        X: *mut i32,
        nvals: *mut GrB_Index,
        A: GrB_Matrix,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_extractTuples_UINT32(
        I: *mut GrB_Index,
        J: *mut GrB_Index,
        X: *mut u32,
        nvals: *mut GrB_Index,
        A: GrB_Matrix,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_extractTuples_INT64(
        I: *mut GrB_Index,
        J: *mut GrB_Index,
        X: *mut i64,
        nvals: *mut GrB_Index,
        A: GrB_Matrix,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_extractTuples_UINT64(
        I: *mut GrB_Index,
        J: *mut GrB_Index,
        X: *mut u64,
        nvals: *mut GrB_Index,
        A: GrB_Matrix,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_extractTuples_FP32(
        I: *mut GrB_Index,
        J: *mut GrB_Index,
        X: *mut f32,
        nvals: *mut GrB_Index,
        A: GrB_Matrix,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_extractTuples_FP64(
        I: *mut GrB_Index,
        J: *mut GrB_Index,
        X: *mut f64,
        nvals: *mut GrB_Index,
        A: GrB_Matrix,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Matrix_extractTuples_FC32(
        I: *mut GrB_Index,
        J: *mut GrB_Index,
        X: *mut GxB_FC32_t,
        nvals: *mut GrB_Index,
        A: GrB_Matrix,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Matrix_extractTuples_FC64(
        I: *mut GrB_Index,
        J: *mut GrB_Index,
        X: *mut GxB_FC64_t,
        nvals: *mut GrB_Index,
        A: GrB_Matrix,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_extractTuples_UDT(
        I: *mut GrB_Index,
        J: *mut GrB_Index,
        X: *mut ::std::os::raw::c_void,
        nvals: *mut GrB_Index,
        A: GrB_Matrix,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Matrix_concat(
        C: GrB_Matrix,
        Tiles: *const GrB_Matrix,
        m: GrB_Index,
        n: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Matrix_split(
        Tiles: *mut GrB_Matrix,
        m: GrB_Index,
        n: GrB_Index,
        Tile_nrows: *const GrB_Index,
        Tile_ncols: *const GrB_Index,
        A: GrB_Matrix,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_diag(C: *mut GrB_Matrix, v: GrB_Vector, k: i64) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Matrix_diag(C: GrB_Matrix, v: GrB_Vector, k: i64, desc: GrB_Descriptor) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Vector_diag(v: GrB_Vector, A: GrB_Matrix, k: i64, desc: GrB_Descriptor) -> GrB_Info;
}
pub const GxB_Option_Field_GxB_HYPER_SWITCH: GxB_Option_Field = 7000;
pub const GxB_Option_Field_GxB_HYPER_HASH: GxB_Option_Field = 7048;
pub const GxB_Option_Field_GxB_BITMAP_SWITCH: GxB_Option_Field = 7001;
pub const GxB_Option_Field_GxB_FORMAT: GxB_Option_Field = 7002;
pub const GxB_Option_Field_GxB_MODE: GxB_Option_Field = 7003;
pub const GxB_Option_Field_GxB_LIBRARY_NAME: GxB_Option_Field = 7004;
pub const GxB_Option_Field_GxB_LIBRARY_VERSION: GxB_Option_Field = 7005;
pub const GxB_Option_Field_GxB_LIBRARY_DATE: GxB_Option_Field = 7006;
pub const GxB_Option_Field_GxB_LIBRARY_ABOUT: GxB_Option_Field = 7007;
pub const GxB_Option_Field_GxB_LIBRARY_URL: GxB_Option_Field = 7008;
pub const GxB_Option_Field_GxB_LIBRARY_LICENSE: GxB_Option_Field = 7009;
pub const GxB_Option_Field_GxB_LIBRARY_COMPILE_DATE: GxB_Option_Field = 7010;
pub const GxB_Option_Field_GxB_LIBRARY_COMPILE_TIME: GxB_Option_Field = 7011;
pub const GxB_Option_Field_GxB_API_VERSION: GxB_Option_Field = 7012;
pub const GxB_Option_Field_GxB_API_DATE: GxB_Option_Field = 7013;
pub const GxB_Option_Field_GxB_API_ABOUT: GxB_Option_Field = 7014;
pub const GxB_Option_Field_GxB_API_URL: GxB_Option_Field = 7015;
pub const GxB_Option_Field_GxB_COMPILER_VERSION: GxB_Option_Field = 7016;
pub const GxB_Option_Field_GxB_COMPILER_NAME: GxB_Option_Field = 7017;
pub const GxB_Option_Field_GxB_LIBRARY_OPENMP: GxB_Option_Field = 7018;
pub const GxB_Option_Field_GxB_MALLOC_FUNCTION: GxB_Option_Field = 7037;
pub const GxB_Option_Field_GxB_CALLOC_FUNCTION: GxB_Option_Field = 7038;
pub const GxB_Option_Field_GxB_REALLOC_FUNCTION: GxB_Option_Field = 7039;
pub const GxB_Option_Field_GxB_FREE_FUNCTION: GxB_Option_Field = 7040;
pub const GxB_Option_Field_GxB_GLOBAL_NTHREADS: GxB_Option_Field = 7086;
pub const GxB_Option_Field_GxB_GLOBAL_CHUNK: GxB_Option_Field = 7087;
pub const GxB_Option_Field_GxB_GLOBAL_GPU_ID: GxB_Option_Field = 7088;
pub const GxB_Option_Field_GxB_BURBLE: GxB_Option_Field = 7019;
pub const GxB_Option_Field_GxB_PRINTF: GxB_Option_Field = 7020;
pub const GxB_Option_Field_GxB_FLUSH: GxB_Option_Field = 7021;
pub const GxB_Option_Field_GxB_MEMORY_POOL: GxB_Option_Field = 7022;
pub const GxB_Option_Field_GxB_PRINT_1BASED: GxB_Option_Field = 7023;
pub const GxB_Option_Field_GxB_JIT_C_COMPILER_NAME: GxB_Option_Field = 7024;
pub const GxB_Option_Field_GxB_JIT_C_COMPILER_FLAGS: GxB_Option_Field = 7025;
pub const GxB_Option_Field_GxB_JIT_C_LINKER_FLAGS: GxB_Option_Field = 7026;
pub const GxB_Option_Field_GxB_JIT_C_LIBRARIES: GxB_Option_Field = 7027;
pub const GxB_Option_Field_GxB_JIT_C_PREFACE: GxB_Option_Field = 7028;
pub const GxB_Option_Field_GxB_JIT_C_CONTROL: GxB_Option_Field = 7029;
pub const GxB_Option_Field_GxB_JIT_CACHE_PATH: GxB_Option_Field = 7030;
pub const GxB_Option_Field_GxB_JIT_C_CMAKE_LIBS: GxB_Option_Field = 7031;
pub const GxB_Option_Field_GxB_JIT_USE_CMAKE: GxB_Option_Field = 7032;
pub const GxB_Option_Field_GxB_JIT_ERROR_LOG: GxB_Option_Field = 7033;
pub const GxB_Option_Field_GxB_SPARSITY_STATUS: GxB_Option_Field = 7034;
pub const GxB_Option_Field_GxB_IS_HYPER: GxB_Option_Field = 7035;
pub const GxB_Option_Field_GxB_SPARSITY_CONTROL: GxB_Option_Field = 7036;
pub type GxB_Option_Field = ::std::os::raw::c_uint;
pub const GxB_JIT_Control_GxB_JIT_OFF: GxB_JIT_Control = 0;
pub const GxB_JIT_Control_GxB_JIT_PAUSE: GxB_JIT_Control = 1;
pub const GxB_JIT_Control_GxB_JIT_RUN: GxB_JIT_Control = 2;
pub const GxB_JIT_Control_GxB_JIT_LOAD: GxB_JIT_Control = 3;
pub const GxB_JIT_Control_GxB_JIT_ON: GxB_JIT_Control = 4;
pub type GxB_JIT_Control = ::std::os::raw::c_uint;
pub const GxB_Format_Value_GxB_BY_ROW: GxB_Format_Value = 0;
pub const GxB_Format_Value_GxB_BY_COL: GxB_Format_Value = 1;
pub const GxB_Format_Value_GxB_NO_FORMAT: GxB_Format_Value = -1;
pub type GxB_Format_Value = ::std::os::raw::c_int;
extern "C" {
    pub static GxB_FORMAT_DEFAULT: GxB_Format_Value;
}
extern "C" {
    pub static GxB_HYPER_DEFAULT: f64;
}
extern "C" {
    pub static GxB_ALWAYS_HYPER: f64;
}
extern "C" {
    pub static GxB_NEVER_HYPER: f64;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_Context_opaque {
    _unused: [u8; 0],
}
pub type GxB_Context = *mut GB_Context_opaque;
extern "C" {
    pub static mut GxB_CONTEXT_WORLD: GxB_Context;
}
pub const GxB_Context_Field_GxB_CONTEXT_NTHREADS: GxB_Context_Field = 7086;
pub const GxB_Context_Field_GxB_CONTEXT_CHUNK: GxB_Context_Field = 7087;
pub const GxB_Context_Field_GxB_CONTEXT_GPU_ID: GxB_Context_Field = 7088;
pub type GxB_Context_Field = ::std::os::raw::c_uint;
extern "C" {
    pub fn GxB_Context_new(Context: *mut GxB_Context) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Context_free(Context: *mut GxB_Context) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Context_engage(Context: GxB_Context) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Context_disengage(Context: GxB_Context) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Matrix_Option_set(arg1: GrB_Matrix, arg2: GxB_Option_Field, ...) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Matrix_Option_set_INT32(
        arg1: GrB_Matrix,
        arg2: GxB_Option_Field,
        arg3: i32,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Matrix_Option_set_FP64(
        arg1: GrB_Matrix,
        arg2: GxB_Option_Field,
        arg3: f64,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Matrix_Option_get(arg1: GrB_Matrix, arg2: GxB_Option_Field, ...) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Matrix_Option_get_INT32(
        arg1: GrB_Matrix,
        arg2: GxB_Option_Field,
        arg3: *mut i32,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Matrix_Option_get_FP64(
        arg1: GrB_Matrix,
        arg2: GxB_Option_Field,
        arg3: *mut f64,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Vector_Option_set(arg1: GrB_Vector, arg2: GxB_Option_Field, ...) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Vector_Option_set_INT32(
        arg1: GrB_Vector,
        arg2: GxB_Option_Field,
        arg3: i32,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Vector_Option_set_FP64(
        arg1: GrB_Vector,
        arg2: GxB_Option_Field,
        arg3: f64,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Vector_Option_get(arg1: GrB_Vector, arg2: GxB_Option_Field, ...) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Vector_Option_get_INT32(
        arg1: GrB_Vector,
        arg2: GxB_Option_Field,
        arg3: *mut i32,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Vector_Option_get_FP64(
        arg1: GrB_Vector,
        arg2: GxB_Option_Field,
        arg3: *mut f64,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Global_Option_set(arg1: GxB_Option_Field, ...) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Global_Option_set_INT32(arg1: GxB_Option_Field, arg2: i32) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Global_Option_set_FP64(arg1: GxB_Option_Field, arg2: f64) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Global_Option_set_FP64_ARRAY(arg1: GxB_Option_Field, arg2: *mut f64) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Global_Option_set_INT64_ARRAY(arg1: GxB_Option_Field, arg2: *mut i64) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Global_Option_set_CHAR(
        arg1: GxB_Option_Field,
        arg2: *const ::std::os::raw::c_char,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Global_Option_set_FUNCTION(
        arg1: GxB_Option_Field,
        arg2: *mut ::std::os::raw::c_void,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Global_Option_get(arg1: GxB_Option_Field, ...) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Global_Option_get_INT32(arg1: GxB_Option_Field, arg2: *mut i32) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Global_Option_get_FP64(arg1: GxB_Option_Field, arg2: *mut f64) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Global_Option_get_INT64(arg1: GxB_Option_Field, arg2: *mut i64) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Global_Option_get_CHAR(
        arg1: GxB_Option_Field,
        arg2: *mut *const ::std::os::raw::c_char,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Global_Option_get_FUNCTION(
        arg1: GxB_Option_Field,
        arg2: *mut *mut ::std::os::raw::c_void,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Context_set_INT32(arg1: GxB_Context, arg2: GxB_Context_Field, arg3: i32)
        -> GrB_Info;
}
extern "C" {
    pub fn GxB_Context_set_FP64(arg1: GxB_Context, arg2: GxB_Context_Field, arg3: f64) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Context_set(arg1: GxB_Context, arg2: GxB_Context_Field, ...) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Context_get_INT32(
        arg1: GxB_Context,
        arg2: GxB_Context_Field,
        arg3: *mut i32,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Context_get_FP64(
        arg1: GxB_Context,
        arg2: GxB_Context_Field,
        arg3: *mut f64,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Context_get(arg1: GxB_Context, arg2: GxB_Context_Field, ...) -> GrB_Info;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_Global_opaque {
    _unused: [u8; 0],
}
pub type GrB_Global = *mut GB_Global_opaque;
extern "C" {
    pub static GrB_GLOBAL: GrB_Global;
}
pub const GrB_Field_GrB_OUTP_FIELD: GrB_Field = 0;
pub const GrB_Field_GrB_MASK_FIELD: GrB_Field = 1;
pub const GrB_Field_GrB_INP0_FIELD: GrB_Field = 2;
pub const GrB_Field_GrB_INP1_FIELD: GrB_Field = 3;
pub const GrB_Field_GrB_NAME: GrB_Field = 10;
pub const GrB_Field_GrB_LIBRARY_VER_MAJOR: GrB_Field = 11;
pub const GrB_Field_GrB_LIBRARY_VER_MINOR: GrB_Field = 12;
pub const GrB_Field_GrB_LIBRARY_VER_PATCH: GrB_Field = 13;
pub const GrB_Field_GrB_API_VER_MAJOR: GrB_Field = 14;
pub const GrB_Field_GrB_API_VER_MINOR: GrB_Field = 15;
pub const GrB_Field_GrB_API_VER_PATCH: GrB_Field = 16;
pub const GrB_Field_GrB_BLOCKING_MODE: GrB_Field = 17;
pub const GrB_Field_GrB_STORAGE_ORIENTATION_HINT: GrB_Field = 100;
pub const GrB_Field_GrB_ELTYPE_CODE: GrB_Field = 102;
pub const GrB_Field_GrB_ELTYPE_STRING: GrB_Field = 106;
pub const GrB_Field_GrB_INPUT1TYPE_CODE: GrB_Field = 103;
pub const GrB_Field_GrB_INPUT2TYPE_CODE: GrB_Field = 104;
pub const GrB_Field_GrB_OUTPUTTYPE_CODE: GrB_Field = 105;
pub const GrB_Field_GrB_INPUT1TYPE_STRING: GrB_Field = 107;
pub const GrB_Field_GrB_INPUT2TYPE_STRING: GrB_Field = 108;
pub const GrB_Field_GrB_OUTPUTTYPE_STRING: GrB_Field = 109;
pub const GrB_Field_GrB_SIZE: GrB_Field = 110;
pub const GrB_Field_GxB_JIT_C_NAME: GrB_Field = 7041;
pub const GrB_Field_GxB_JIT_C_DEFINITION: GrB_Field = 7042;
pub const GrB_Field_GxB_MONOID_IDENTITY: GrB_Field = 7043;
pub const GrB_Field_GxB_MONOID_TERMINAL: GrB_Field = 7044;
pub const GrB_Field_GxB_MONOID_OPERATOR: GrB_Field = 7045;
pub const GrB_Field_GxB_SEMIRING_MONOID: GrB_Field = 7046;
pub const GrB_Field_GxB_SEMIRING_MULTIPLY: GrB_Field = 7047;
pub type GrB_Field = ::std::os::raw::c_uint;
pub const GrB_Orientation_GrB_ROWMAJOR: GrB_Orientation = 0;
pub const GrB_Orientation_GrB_COLMAJOR: GrB_Orientation = 1;
pub const GrB_Orientation_GrB_BOTH: GrB_Orientation = 2;
pub const GrB_Orientation_GrB_UNKNOWN: GrB_Orientation = 3;
pub type GrB_Orientation = ::std::os::raw::c_uint;
pub const GrB_Type_Code_GrB_UDT_CODE: GrB_Type_Code = 0;
pub const GrB_Type_Code_GrB_BOOL_CODE: GrB_Type_Code = 1;
pub const GrB_Type_Code_GrB_INT8_CODE: GrB_Type_Code = 2;
pub const GrB_Type_Code_GrB_UINT8_CODE: GrB_Type_Code = 3;
pub const GrB_Type_Code_GrB_INT16_CODE: GrB_Type_Code = 4;
pub const GrB_Type_Code_GrB_UINT16_CODE: GrB_Type_Code = 5;
pub const GrB_Type_Code_GrB_INT32_CODE: GrB_Type_Code = 6;
pub const GrB_Type_Code_GrB_UINT32_CODE: GrB_Type_Code = 7;
pub const GrB_Type_Code_GrB_INT64_CODE: GrB_Type_Code = 8;
pub const GrB_Type_Code_GrB_UINT64_CODE: GrB_Type_Code = 9;
pub const GrB_Type_Code_GrB_FP32_CODE: GrB_Type_Code = 10;
pub const GrB_Type_Code_GrB_FP64_CODE: GrB_Type_Code = 11;
pub const GrB_Type_Code_GxB_FC32_CODE: GrB_Type_Code = 7070;
pub const GrB_Type_Code_GxB_FC64_CODE: GrB_Type_Code = 7071;
pub type GrB_Type_Code = ::std::os::raw::c_uint;
extern "C" {
    pub fn GrB_Scalar_get_Scalar(arg1: GrB_Scalar, arg2: GrB_Scalar, arg3: GrB_Field) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Scalar_get_String(
        arg1: GrB_Scalar,
        arg2: *mut ::std::os::raw::c_char,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Scalar_get_INT32(arg1: GrB_Scalar, arg2: *mut i32, arg3: GrB_Field) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Scalar_get_SIZE(arg1: GrB_Scalar, arg2: *mut usize, arg3: GrB_Field) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Scalar_get_VOID(
        arg1: GrB_Scalar,
        arg2: *mut ::std::os::raw::c_void,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_get_Scalar(arg1: GrB_Vector, arg2: GrB_Scalar, arg3: GrB_Field) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_get_String(
        arg1: GrB_Vector,
        arg2: *mut ::std::os::raw::c_char,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_get_INT32(arg1: GrB_Vector, arg2: *mut i32, arg3: GrB_Field) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_get_SIZE(arg1: GrB_Vector, arg2: *mut usize, arg3: GrB_Field) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_get_VOID(
        arg1: GrB_Vector,
        arg2: *mut ::std::os::raw::c_void,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_get_Scalar(arg1: GrB_Matrix, arg2: GrB_Scalar, arg3: GrB_Field) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_get_String(
        arg1: GrB_Matrix,
        arg2: *mut ::std::os::raw::c_char,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_get_INT32(arg1: GrB_Matrix, arg2: *mut i32, arg3: GrB_Field) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_get_SIZE(arg1: GrB_Matrix, arg2: *mut usize, arg3: GrB_Field) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_get_VOID(
        arg1: GrB_Matrix,
        arg2: *mut ::std::os::raw::c_void,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Serialized_get_Scalar(
        arg1: *const ::std::os::raw::c_void,
        arg2: GrB_Scalar,
        arg3: GrB_Field,
        arg4: usize,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Serialized_get_String(
        arg1: *const ::std::os::raw::c_void,
        arg2: *mut ::std::os::raw::c_char,
        arg3: GrB_Field,
        arg4: usize,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Serialized_get_INT32(
        arg1: *const ::std::os::raw::c_void,
        arg2: *mut i32,
        arg3: GrB_Field,
        arg4: usize,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Serialized_get_SIZE(
        arg1: *const ::std::os::raw::c_void,
        arg2: *mut usize,
        arg3: GrB_Field,
        arg4: usize,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Serialized_get_VOID(
        arg1: *const ::std::os::raw::c_void,
        arg2: *mut ::std::os::raw::c_void,
        arg3: GrB_Field,
        arg4: usize,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_UnaryOp_get_Scalar(arg1: GrB_UnaryOp, arg2: GrB_Scalar, arg3: GrB_Field)
        -> GrB_Info;
}
extern "C" {
    pub fn GrB_UnaryOp_get_String(
        arg1: GrB_UnaryOp,
        arg2: *mut ::std::os::raw::c_char,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_UnaryOp_get_INT32(arg1: GrB_UnaryOp, arg2: *mut i32, arg3: GrB_Field) -> GrB_Info;
}
extern "C" {
    pub fn GrB_UnaryOp_get_SIZE(arg1: GrB_UnaryOp, arg2: *mut usize, arg3: GrB_Field) -> GrB_Info;
}
extern "C" {
    pub fn GrB_UnaryOp_get_VOID(
        arg1: GrB_UnaryOp,
        arg2: *mut ::std::os::raw::c_void,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_IndexUnaryOp_get_Scalar(
        arg1: GrB_IndexUnaryOp,
        arg2: GrB_Scalar,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_IndexUnaryOp_get_String(
        arg1: GrB_IndexUnaryOp,
        arg2: *mut ::std::os::raw::c_char,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_IndexUnaryOp_get_INT32(
        arg1: GrB_IndexUnaryOp,
        arg2: *mut i32,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_IndexUnaryOp_get_SIZE(
        arg1: GrB_IndexUnaryOp,
        arg2: *mut usize,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_IndexUnaryOp_get_VOID(
        arg1: GrB_IndexUnaryOp,
        arg2: *mut ::std::os::raw::c_void,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_BinaryOp_get_Scalar(
        arg1: GrB_BinaryOp,
        arg2: GrB_Scalar,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_BinaryOp_get_String(
        arg1: GrB_BinaryOp,
        arg2: *mut ::std::os::raw::c_char,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_BinaryOp_get_INT32(arg1: GrB_BinaryOp, arg2: *mut i32, arg3: GrB_Field) -> GrB_Info;
}
extern "C" {
    pub fn GrB_BinaryOp_get_SIZE(arg1: GrB_BinaryOp, arg2: *mut usize, arg3: GrB_Field)
        -> GrB_Info;
}
extern "C" {
    pub fn GrB_BinaryOp_get_VOID(
        arg1: GrB_BinaryOp,
        arg2: *mut ::std::os::raw::c_void,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Monoid_get_Scalar(arg1: GrB_Monoid, arg2: GrB_Scalar, arg3: GrB_Field) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Monoid_get_String(
        arg1: GrB_Monoid,
        arg2: *mut ::std::os::raw::c_char,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Monoid_get_INT32(arg1: GrB_Monoid, arg2: *mut i32, arg3: GrB_Field) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Monoid_get_SIZE(arg1: GrB_Monoid, arg2: *mut usize, arg3: GrB_Field) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Monoid_get_VOID(
        arg1: GrB_Monoid,
        arg2: *mut ::std::os::raw::c_void,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Semiring_get_Scalar(
        arg1: GrB_Semiring,
        arg2: GrB_Scalar,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Semiring_get_String(
        arg1: GrB_Semiring,
        arg2: *mut ::std::os::raw::c_char,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Semiring_get_INT32(arg1: GrB_Semiring, arg2: *mut i32, arg3: GrB_Field) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Semiring_get_SIZE(arg1: GrB_Semiring, arg2: *mut usize, arg3: GrB_Field)
        -> GrB_Info;
}
extern "C" {
    pub fn GrB_Semiring_get_VOID(
        arg1: GrB_Semiring,
        arg2: *mut ::std::os::raw::c_void,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Descriptor_get_Scalar(
        arg1: GrB_Descriptor,
        arg2: GrB_Scalar,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Descriptor_get_String(
        arg1: GrB_Descriptor,
        arg2: *mut ::std::os::raw::c_char,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Descriptor_get_INT32(
        arg1: GrB_Descriptor,
        arg2: *mut i32,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Descriptor_get_SIZE(
        arg1: GrB_Descriptor,
        arg2: *mut usize,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Descriptor_get_VOID(
        arg1: GrB_Descriptor,
        arg2: *mut ::std::os::raw::c_void,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Type_get_Scalar(arg1: GrB_Type, arg2: GrB_Scalar, arg3: GrB_Field) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Type_get_String(
        arg1: GrB_Type,
        arg2: *mut ::std::os::raw::c_char,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Type_get_INT32(arg1: GrB_Type, arg2: *mut i32, arg3: GrB_Field) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Type_get_SIZE(arg1: GrB_Type, arg2: *mut usize, arg3: GrB_Field) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Type_get_VOID(
        arg1: GrB_Type,
        arg2: *mut ::std::os::raw::c_void,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Global_get_Scalar(arg1: GrB_Global, arg2: GrB_Scalar, arg3: GrB_Field) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Global_get_String(
        arg1: GrB_Global,
        arg2: *mut ::std::os::raw::c_char,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Global_get_INT32(arg1: GrB_Global, arg2: *mut i32, arg3: GrB_Field) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Global_get_SIZE(arg1: GrB_Global, arg2: *mut usize, arg3: GrB_Field) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Global_get_VOID(
        arg1: GrB_Global,
        arg2: *mut ::std::os::raw::c_void,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Context_get_Scalar(arg1: GxB_Context, arg2: GrB_Scalar, arg3: GrB_Field)
        -> GrB_Info;
}
extern "C" {
    pub fn GxB_Context_get_String(
        arg1: GxB_Context,
        arg2: *mut ::std::os::raw::c_char,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Context_get_INT(arg1: GxB_Context, arg2: *mut i32, arg3: GrB_Field) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Context_get_SIZE(arg1: GxB_Context, arg2: *mut usize, arg3: GrB_Field) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Context_get_VOID(
        arg1: GxB_Context,
        arg2: *mut ::std::os::raw::c_void,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Scalar_set_Scalar(arg1: GrB_Scalar, arg2: GrB_Scalar, arg3: GrB_Field) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Scalar_set_String(
        arg1: GrB_Scalar,
        arg2: *mut ::std::os::raw::c_char,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Scalar_set_INT32(arg1: GrB_Scalar, arg2: i32, arg3: GrB_Field) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Scalar_set_VOID(
        arg1: GrB_Scalar,
        arg2: *mut ::std::os::raw::c_void,
        arg3: GrB_Field,
        arg4: usize,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_set_Scalar(arg1: GrB_Vector, arg2: GrB_Scalar, arg3: GrB_Field) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_set_String(
        arg1: GrB_Vector,
        arg2: *mut ::std::os::raw::c_char,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_set_INT32(arg1: GrB_Vector, arg2: i32, arg3: GrB_Field) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_set_VOID(
        arg1: GrB_Vector,
        arg2: *mut ::std::os::raw::c_void,
        arg3: GrB_Field,
        arg4: usize,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_set_Scalar(arg1: GrB_Matrix, arg2: GrB_Scalar, arg3: GrB_Field) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_set_String(
        arg1: GrB_Matrix,
        arg2: *mut ::std::os::raw::c_char,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_set_INT32(arg1: GrB_Matrix, arg2: i32, arg3: GrB_Field) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_set_VOID(
        arg1: GrB_Matrix,
        arg2: *mut ::std::os::raw::c_void,
        arg3: GrB_Field,
        arg4: usize,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_UnaryOp_set_Scalar(arg1: GrB_UnaryOp, arg2: GrB_Scalar, arg3: GrB_Field)
        -> GrB_Info;
}
extern "C" {
    pub fn GrB_UnaryOp_set_String(
        arg1: GrB_UnaryOp,
        arg2: *mut ::std::os::raw::c_char,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_UnaryOp_set_INT32(arg1: GrB_UnaryOp, arg2: i32, arg3: GrB_Field) -> GrB_Info;
}
extern "C" {
    pub fn GrB_UnaryOp_set_VOID(
        arg1: GrB_UnaryOp,
        arg2: *mut ::std::os::raw::c_void,
        arg3: GrB_Field,
        arg4: usize,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_IndexUnaryOp_set_Scalar(
        arg1: GrB_IndexUnaryOp,
        arg2: GrB_Scalar,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_IndexUnaryOp_set_String(
        arg1: GrB_IndexUnaryOp,
        arg2: *mut ::std::os::raw::c_char,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_IndexUnaryOp_set_INT32(
        arg1: GrB_IndexUnaryOp,
        arg2: i32,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_IndexUnaryOp_set_VOID(
        arg1: GrB_IndexUnaryOp,
        arg2: *mut ::std::os::raw::c_void,
        arg3: GrB_Field,
        arg4: usize,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_BinaryOp_set_Scalar(
        arg1: GrB_BinaryOp,
        arg2: GrB_Scalar,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_BinaryOp_set_String(
        arg1: GrB_BinaryOp,
        arg2: *mut ::std::os::raw::c_char,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_BinaryOp_set_INT32(arg1: GrB_BinaryOp, arg2: i32, arg3: GrB_Field) -> GrB_Info;
}
extern "C" {
    pub fn GrB_BinaryOp_set_VOID(
        arg1: GrB_BinaryOp,
        arg2: *mut ::std::os::raw::c_void,
        arg3: GrB_Field,
        arg4: usize,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Monoid_set_Scalar(arg1: GrB_Monoid, arg2: GrB_Scalar, arg3: GrB_Field) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Monoid_set_String(
        arg1: GrB_Monoid,
        arg2: *mut ::std::os::raw::c_char,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Monoid_set_INT32(arg1: GrB_Monoid, arg2: i32, arg3: GrB_Field) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Monoid_set_VOID(
        arg1: GrB_Monoid,
        arg2: *mut ::std::os::raw::c_void,
        arg3: GrB_Field,
        arg4: usize,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Semiring_set_Scalar(
        arg1: GrB_Semiring,
        arg2: GrB_Scalar,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Semiring_set_String(
        arg1: GrB_Semiring,
        arg2: *mut ::std::os::raw::c_char,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Semiring_set_INT32(arg1: GrB_Semiring, arg2: i32, arg3: GrB_Field) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Semiring_set_VOID(
        arg1: GrB_Semiring,
        arg2: *mut ::std::os::raw::c_void,
        arg3: GrB_Field,
        arg4: usize,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Descriptor_set_Scalar(
        arg1: GrB_Descriptor,
        arg2: GrB_Scalar,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Descriptor_set_String(
        arg1: GrB_Descriptor,
        arg2: *mut ::std::os::raw::c_char,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Descriptor_set_INT32(arg1: GrB_Descriptor, arg2: i32, arg3: GrB_Field) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Descriptor_set_VOID(
        arg1: GrB_Descriptor,
        arg2: *mut ::std::os::raw::c_void,
        arg3: GrB_Field,
        arg4: usize,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Type_set_Scalar(arg1: GrB_Type, arg2: GrB_Scalar, arg3: GrB_Field) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Type_set_String(
        arg1: GrB_Type,
        arg2: *mut ::std::os::raw::c_char,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Type_set_INT32(arg1: GrB_Type, arg2: i32, arg3: GrB_Field) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Type_set_VOID(
        arg1: GrB_Type,
        arg2: *mut ::std::os::raw::c_void,
        arg3: GrB_Field,
        arg4: usize,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Global_set_Scalar(arg1: GrB_Global, arg2: GrB_Scalar, arg3: GrB_Field) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Global_set_String(
        arg1: GrB_Global,
        arg2: *mut ::std::os::raw::c_char,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Global_set_INT32(arg1: GrB_Global, arg2: i32, arg3: GrB_Field) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Global_set_VOID(
        arg1: GrB_Global,
        arg2: *mut ::std::os::raw::c_void,
        arg3: GrB_Field,
        arg4: usize,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Context_set_Scalar(arg1: GxB_Context, arg2: GrB_Scalar, arg3: GrB_Field)
        -> GrB_Info;
}
extern "C" {
    pub fn GxB_Context_set_String(
        arg1: GxB_Context,
        arg2: *mut ::std::os::raw::c_char,
        arg3: GrB_Field,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Context_set_INT(arg1: GxB_Context, arg2: i32, arg3: GrB_Field) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Context_set_VOID(
        arg1: GxB_Context,
        arg2: *mut ::std::os::raw::c_void,
        arg3: GrB_Field,
        arg4: usize,
    ) -> GrB_Info;
}
pub const GrB_WaitMode_GrB_COMPLETE: GrB_WaitMode = 0;
pub const GrB_WaitMode_GrB_MATERIALIZE: GrB_WaitMode = 1;
pub type GrB_WaitMode = ::std::os::raw::c_uint;
extern "C" {
    pub fn GrB_Type_wait(type_: GrB_Type, waitmode: GrB_WaitMode) -> GrB_Info;
}
extern "C" {
    pub fn GrB_UnaryOp_wait(op: GrB_UnaryOp, waitmode: GrB_WaitMode) -> GrB_Info;
}
extern "C" {
    pub fn GrB_BinaryOp_wait(op: GrB_BinaryOp, waitmode: GrB_WaitMode) -> GrB_Info;
}
extern "C" {
    pub fn GrB_IndexUnaryOp_wait(op: GrB_IndexUnaryOp, waitmode: GrB_WaitMode) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Monoid_wait(monoid: GrB_Monoid, waitmode: GrB_WaitMode) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Semiring_wait(semiring: GrB_Semiring, waitmode: GrB_WaitMode) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Descriptor_wait(desc: GrB_Descriptor, waitmode: GrB_WaitMode) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Scalar_wait(s: GrB_Scalar, waitmode: GrB_WaitMode) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_wait(v: GrB_Vector, waitmode: GrB_WaitMode) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_wait(A: GrB_Matrix, waitmode: GrB_WaitMode) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Context_wait(Context: GxB_Context, waitmode: GrB_WaitMode) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Scalar_wait(s: *mut GrB_Scalar) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Type_error(error: *mut *const ::std::os::raw::c_char, type_: GrB_Type) -> GrB_Info;
}
extern "C" {
    pub fn GrB_UnaryOp_error(
        error: *mut *const ::std::os::raw::c_char,
        op: GrB_UnaryOp,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_BinaryOp_error(
        error: *mut *const ::std::os::raw::c_char,
        op: GrB_BinaryOp,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_IndexUnaryOp_error(
        error: *mut *const ::std::os::raw::c_char,
        op: GrB_IndexUnaryOp,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Monoid_error(
        error: *mut *const ::std::os::raw::c_char,
        monoid: GrB_Monoid,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Semiring_error(
        error: *mut *const ::std::os::raw::c_char,
        semiring: GrB_Semiring,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Scalar_error(error: *mut *const ::std::os::raw::c_char, s: GrB_Scalar) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_error(error: *mut *const ::std::os::raw::c_char, v: GrB_Vector) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_error(error: *mut *const ::std::os::raw::c_char, A: GrB_Matrix) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Descriptor_error(
        error: *mut *const ::std::os::raw::c_char,
        d: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Scalar_error(error: *mut *const ::std::os::raw::c_char, s: GrB_Scalar) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Context_error(
        error: *mut *const ::std::os::raw::c_char,
        Context: GxB_Context,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_mxm(
        C: GrB_Matrix,
        Mask: GrB_Matrix,
        accum: GrB_BinaryOp,
        semiring: GrB_Semiring,
        A: GrB_Matrix,
        B: GrB_Matrix,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_vxm(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        semiring: GrB_Semiring,
        u: GrB_Vector,
        A: GrB_Matrix,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_mxv(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        semiring: GrB_Semiring,
        A: GrB_Matrix,
        u: GrB_Vector,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_eWiseMult_Semiring(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        semiring: GrB_Semiring,
        u: GrB_Vector,
        v: GrB_Vector,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_eWiseMult_Monoid(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        monoid: GrB_Monoid,
        u: GrB_Vector,
        v: GrB_Vector,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_eWiseMult_BinaryOp(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        mult: GrB_BinaryOp,
        u: GrB_Vector,
        v: GrB_Vector,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_eWiseMult_Semiring(
        C: GrB_Matrix,
        Mask: GrB_Matrix,
        accum: GrB_BinaryOp,
        semiring: GrB_Semiring,
        A: GrB_Matrix,
        B: GrB_Matrix,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_eWiseMult_Monoid(
        C: GrB_Matrix,
        Mask: GrB_Matrix,
        accum: GrB_BinaryOp,
        monoid: GrB_Monoid,
        A: GrB_Matrix,
        B: GrB_Matrix,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_eWiseMult_BinaryOp(
        C: GrB_Matrix,
        Mask: GrB_Matrix,
        accum: GrB_BinaryOp,
        mult: GrB_BinaryOp,
        A: GrB_Matrix,
        B: GrB_Matrix,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_eWiseAdd_Semiring(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        semiring: GrB_Semiring,
        u: GrB_Vector,
        v: GrB_Vector,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_eWiseAdd_Monoid(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        monoid: GrB_Monoid,
        u: GrB_Vector,
        v: GrB_Vector,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_eWiseAdd_BinaryOp(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        add: GrB_BinaryOp,
        u: GrB_Vector,
        v: GrB_Vector,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_eWiseAdd_Semiring(
        C: GrB_Matrix,
        Mask: GrB_Matrix,
        accum: GrB_BinaryOp,
        semiring: GrB_Semiring,
        A: GrB_Matrix,
        B: GrB_Matrix,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_eWiseAdd_Monoid(
        C: GrB_Matrix,
        Mask: GrB_Matrix,
        accum: GrB_BinaryOp,
        monoid: GrB_Monoid,
        A: GrB_Matrix,
        B: GrB_Matrix,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_eWiseAdd_BinaryOp(
        C: GrB_Matrix,
        Mask: GrB_Matrix,
        accum: GrB_BinaryOp,
        add: GrB_BinaryOp,
        A: GrB_Matrix,
        B: GrB_Matrix,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Vector_eWiseUnion(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        add: GrB_BinaryOp,
        u: GrB_Vector,
        alpha: GrB_Scalar,
        v: GrB_Vector,
        beta: GrB_Scalar,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Matrix_eWiseUnion(
        C: GrB_Matrix,
        Mask: GrB_Matrix,
        accum: GrB_BinaryOp,
        add: GrB_BinaryOp,
        A: GrB_Matrix,
        alpha: GrB_Scalar,
        B: GrB_Matrix,
        beta: GrB_Scalar,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub static mut GrB_ALL: *const u64;
}
extern "C" {
    pub fn GrB_Vector_extract(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        u: GrB_Vector,
        I: *const GrB_Index,
        ni: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_extract(
        C: GrB_Matrix,
        Mask: GrB_Matrix,
        accum: GrB_BinaryOp,
        A: GrB_Matrix,
        I: *const GrB_Index,
        ni: GrB_Index,
        J: *const GrB_Index,
        nj: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Col_extract(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        A: GrB_Matrix,
        I: *const GrB_Index,
        ni: GrB_Index,
        j: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Vector_subassign(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        u: GrB_Vector,
        I: *const GrB_Index,
        ni: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Matrix_subassign(
        C: GrB_Matrix,
        Mask: GrB_Matrix,
        accum: GrB_BinaryOp,
        A: GrB_Matrix,
        I: *const GrB_Index,
        ni: GrB_Index,
        J: *const GrB_Index,
        nj: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Col_subassign(
        C: GrB_Matrix,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        u: GrB_Vector,
        I: *const GrB_Index,
        ni: GrB_Index,
        j: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Row_subassign(
        C: GrB_Matrix,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        u: GrB_Vector,
        i: GrB_Index,
        J: *const GrB_Index,
        nj: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Vector_subassign_BOOL(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        x: bool,
        I: *const GrB_Index,
        ni: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Vector_subassign_INT8(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        x: i8,
        I: *const GrB_Index,
        ni: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Vector_subassign_UINT8(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        x: u8,
        I: *const GrB_Index,
        ni: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Vector_subassign_INT16(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        x: i16,
        I: *const GrB_Index,
        ni: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Vector_subassign_UINT16(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        x: u16,
        I: *const GrB_Index,
        ni: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Vector_subassign_INT32(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        x: i32,
        I: *const GrB_Index,
        ni: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Vector_subassign_UINT32(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        x: u32,
        I: *const GrB_Index,
        ni: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Vector_subassign_INT64(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        x: i64,
        I: *const GrB_Index,
        ni: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Vector_subassign_UINT64(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        x: u64,
        I: *const GrB_Index,
        ni: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Vector_subassign_FP32(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        x: f32,
        I: *const GrB_Index,
        ni: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Vector_subassign_FP64(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        x: f64,
        I: *const GrB_Index,
        ni: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Vector_subassign_FC32(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        x: GxB_FC32_t,
        I: *const GrB_Index,
        ni: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Vector_subassign_FC64(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        x: GxB_FC64_t,
        I: *const GrB_Index,
        ni: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Vector_subassign_UDT(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        x: *mut ::std::os::raw::c_void,
        I: *const GrB_Index,
        ni: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Vector_subassign_Scalar(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        x: GrB_Scalar,
        I: *const GrB_Index,
        ni: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Matrix_subassign_BOOL(
        C: GrB_Matrix,
        Mask: GrB_Matrix,
        accum: GrB_BinaryOp,
        x: bool,
        I: *const GrB_Index,
        ni: GrB_Index,
        J: *const GrB_Index,
        nj: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Matrix_subassign_INT8(
        C: GrB_Matrix,
        Mask: GrB_Matrix,
        accum: GrB_BinaryOp,
        x: i8,
        I: *const GrB_Index,
        ni: GrB_Index,
        J: *const GrB_Index,
        nj: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Matrix_subassign_UINT8(
        C: GrB_Matrix,
        Mask: GrB_Matrix,
        accum: GrB_BinaryOp,
        x: u8,
        I: *const GrB_Index,
        ni: GrB_Index,
        J: *const GrB_Index,
        nj: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Matrix_subassign_INT16(
        C: GrB_Matrix,
        Mask: GrB_Matrix,
        accum: GrB_BinaryOp,
        x: i16,
        I: *const GrB_Index,
        ni: GrB_Index,
        J: *const GrB_Index,
        nj: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Matrix_subassign_UINT16(
        C: GrB_Matrix,
        Mask: GrB_Matrix,
        accum: GrB_BinaryOp,
        x: u16,
        I: *const GrB_Index,
        ni: GrB_Index,
        J: *const GrB_Index,
        nj: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Matrix_subassign_INT32(
        C: GrB_Matrix,
        Mask: GrB_Matrix,
        accum: GrB_BinaryOp,
        x: i32,
        I: *const GrB_Index,
        ni: GrB_Index,
        J: *const GrB_Index,
        nj: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Matrix_subassign_UINT32(
        C: GrB_Matrix,
        Mask: GrB_Matrix,
        accum: GrB_BinaryOp,
        x: u32,
        I: *const GrB_Index,
        ni: GrB_Index,
        J: *const GrB_Index,
        nj: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Matrix_subassign_INT64(
        C: GrB_Matrix,
        Mask: GrB_Matrix,
        accum: GrB_BinaryOp,
        x: i64,
        I: *const GrB_Index,
        ni: GrB_Index,
        J: *const GrB_Index,
        nj: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Matrix_subassign_UINT64(
        C: GrB_Matrix,
        Mask: GrB_Matrix,
        accum: GrB_BinaryOp,
        x: u64,
        I: *const GrB_Index,
        ni: GrB_Index,
        J: *const GrB_Index,
        nj: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Matrix_subassign_FP32(
        C: GrB_Matrix,
        Mask: GrB_Matrix,
        accum: GrB_BinaryOp,
        x: f32,
        I: *const GrB_Index,
        ni: GrB_Index,
        J: *const GrB_Index,
        nj: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Matrix_subassign_FP64(
        C: GrB_Matrix,
        Mask: GrB_Matrix,
        accum: GrB_BinaryOp,
        x: f64,
        I: *const GrB_Index,
        ni: GrB_Index,
        J: *const GrB_Index,
        nj: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Matrix_subassign_FC32(
        C: GrB_Matrix,
        Mask: GrB_Matrix,
        accum: GrB_BinaryOp,
        x: GxB_FC32_t,
        I: *const GrB_Index,
        ni: GrB_Index,
        J: *const GrB_Index,
        nj: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Matrix_subassign_FC64(
        C: GrB_Matrix,
        Mask: GrB_Matrix,
        accum: GrB_BinaryOp,
        x: GxB_FC64_t,
        I: *const GrB_Index,
        ni: GrB_Index,
        J: *const GrB_Index,
        nj: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Matrix_subassign_UDT(
        C: GrB_Matrix,
        Mask: GrB_Matrix,
        accum: GrB_BinaryOp,
        x: *mut ::std::os::raw::c_void,
        I: *const GrB_Index,
        ni: GrB_Index,
        J: *const GrB_Index,
        nj: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Matrix_subassign_Scalar(
        C: GrB_Matrix,
        Mask: GrB_Matrix,
        accum: GrB_BinaryOp,
        x: GrB_Scalar,
        I: *const GrB_Index,
        ni: GrB_Index,
        J: *const GrB_Index,
        nj: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_assign(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        u: GrB_Vector,
        I: *const GrB_Index,
        ni: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_assign(
        C: GrB_Matrix,
        Mask: GrB_Matrix,
        accum: GrB_BinaryOp,
        A: GrB_Matrix,
        I: *const GrB_Index,
        ni: GrB_Index,
        J: *const GrB_Index,
        nj: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Col_assign(
        C: GrB_Matrix,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        u: GrB_Vector,
        I: *const GrB_Index,
        ni: GrB_Index,
        j: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Row_assign(
        C: GrB_Matrix,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        u: GrB_Vector,
        i: GrB_Index,
        J: *const GrB_Index,
        nj: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_assign_BOOL(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        x: bool,
        I: *const GrB_Index,
        ni: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_assign_INT8(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        x: i8,
        I: *const GrB_Index,
        ni: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_assign_UINT8(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        x: u8,
        I: *const GrB_Index,
        ni: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_assign_INT16(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        x: i16,
        I: *const GrB_Index,
        ni: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_assign_UINT16(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        x: u16,
        I: *const GrB_Index,
        ni: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_assign_INT32(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        x: i32,
        I: *const GrB_Index,
        ni: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_assign_UINT32(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        x: u32,
        I: *const GrB_Index,
        ni: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_assign_INT64(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        x: i64,
        I: *const GrB_Index,
        ni: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_assign_UINT64(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        x: u64,
        I: *const GrB_Index,
        ni: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_assign_FP32(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        x: f32,
        I: *const GrB_Index,
        ni: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_assign_FP64(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        x: f64,
        I: *const GrB_Index,
        ni: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Vector_assign_FC32(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        x: GxB_FC32_t,
        I: *const GrB_Index,
        ni: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Vector_assign_FC64(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        x: GxB_FC64_t,
        I: *const GrB_Index,
        ni: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_assign_UDT(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        x: *mut ::std::os::raw::c_void,
        I: *const GrB_Index,
        ni: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_assign_Scalar(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        x: GrB_Scalar,
        I: *const GrB_Index,
        ni: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_assign_BOOL(
        C: GrB_Matrix,
        Mask: GrB_Matrix,
        accum: GrB_BinaryOp,
        x: bool,
        I: *const GrB_Index,
        ni: GrB_Index,
        J: *const GrB_Index,
        nj: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_assign_INT8(
        C: GrB_Matrix,
        Mask: GrB_Matrix,
        accum: GrB_BinaryOp,
        x: i8,
        I: *const GrB_Index,
        ni: GrB_Index,
        J: *const GrB_Index,
        nj: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_assign_UINT8(
        C: GrB_Matrix,
        Mask: GrB_Matrix,
        accum: GrB_BinaryOp,
        x: u8,
        I: *const GrB_Index,
        ni: GrB_Index,
        J: *const GrB_Index,
        nj: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_assign_INT16(
        C: GrB_Matrix,
        Mask: GrB_Matrix,
        accum: GrB_BinaryOp,
        x: i16,
        I: *const GrB_Index,
        ni: GrB_Index,
        J: *const GrB_Index,
        nj: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_assign_UINT16(
        C: GrB_Matrix,
        Mask: GrB_Matrix,
        accum: GrB_BinaryOp,
        x: u16,
        I: *const GrB_Index,
        ni: GrB_Index,
        J: *const GrB_Index,
        nj: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_assign_INT32(
        C: GrB_Matrix,
        Mask: GrB_Matrix,
        accum: GrB_BinaryOp,
        x: i32,
        I: *const GrB_Index,
        ni: GrB_Index,
        J: *const GrB_Index,
        nj: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_assign_UINT32(
        C: GrB_Matrix,
        Mask: GrB_Matrix,
        accum: GrB_BinaryOp,
        x: u32,
        I: *const GrB_Index,
        ni: GrB_Index,
        J: *const GrB_Index,
        nj: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_assign_INT64(
        C: GrB_Matrix,
        Mask: GrB_Matrix,
        accum: GrB_BinaryOp,
        x: i64,
        I: *const GrB_Index,
        ni: GrB_Index,
        J: *const GrB_Index,
        nj: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_assign_UINT64(
        C: GrB_Matrix,
        Mask: GrB_Matrix,
        accum: GrB_BinaryOp,
        x: u64,
        I: *const GrB_Index,
        ni: GrB_Index,
        J: *const GrB_Index,
        nj: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_assign_FP32(
        C: GrB_Matrix,
        Mask: GrB_Matrix,
        accum: GrB_BinaryOp,
        x: f32,
        I: *const GrB_Index,
        ni: GrB_Index,
        J: *const GrB_Index,
        nj: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_assign_FP64(
        C: GrB_Matrix,
        Mask: GrB_Matrix,
        accum: GrB_BinaryOp,
        x: f64,
        I: *const GrB_Index,
        ni: GrB_Index,
        J: *const GrB_Index,
        nj: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Matrix_assign_FC32(
        C: GrB_Matrix,
        Mask: GrB_Matrix,
        accum: GrB_BinaryOp,
        x: GxB_FC32_t,
        I: *const GrB_Index,
        ni: GrB_Index,
        J: *const GrB_Index,
        nj: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Matrix_assign_FC64(
        C: GrB_Matrix,
        Mask: GrB_Matrix,
        accum: GrB_BinaryOp,
        x: GxB_FC64_t,
        I: *const GrB_Index,
        ni: GrB_Index,
        J: *const GrB_Index,
        nj: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_assign_UDT(
        C: GrB_Matrix,
        Mask: GrB_Matrix,
        accum: GrB_BinaryOp,
        x: *mut ::std::os::raw::c_void,
        I: *const GrB_Index,
        ni: GrB_Index,
        J: *const GrB_Index,
        nj: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_assign_Scalar(
        C: GrB_Matrix,
        Mask: GrB_Matrix,
        accum: GrB_BinaryOp,
        x: GrB_Scalar,
        I: *const GrB_Index,
        ni: GrB_Index,
        J: *const GrB_Index,
        nj: GrB_Index,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_apply(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        op: GrB_UnaryOp,
        u: GrB_Vector,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Matrix_apply(
        C: GrB_Matrix,
        Mask: GrB_Matrix,
        accum: GrB_BinaryOp,
        op: GrB_UnaryOp,
        A: GrB_Matrix,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_apply_BinaryOp1st_Scalar(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        op: GrB_BinaryOp,
        x: GrB_Scalar,
        u: GrB_Vector,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GxB_Vector_apply_BinaryOp1st(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        op: GrB_BinaryOp,
        x: GrB_Scalar,
        u: GrB_Vector,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_apply_BinaryOp1st_BOOL(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        op: GrB_BinaryOp,
        x: bool,
        u: GrB_Vector,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_apply_BinaryOp1st_INT8(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        op: GrB_BinaryOp,
        x: i8,
        u: GrB_Vector,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_apply_BinaryOp1st_INT16(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        op: GrB_BinaryOp,
        x: i16,
        u: GrB_Vector,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_apply_BinaryOp1st_INT32(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        op: GrB_BinaryOp,
        x: i32,
        u: GrB_Vector,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_apply_BinaryOp1st_INT64(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        op: GrB_BinaryOp,
        x: i64,
        u: GrB_Vector,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_apply_BinaryOp1st_UINT8(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        op: GrB_BinaryOp,
        x: u8,
        u: GrB_Vector,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_apply_BinaryOp1st_UINT16(
        w: GrB_Vector,
        mask: GrB_Vector,
        accum: GrB_BinaryOp,
        op: GrB_BinaryOp,
        x: u16,
        u: GrB_Vector,
        desc: GrB_Descriptor,
    ) -> GrB_Info;
}
extern "C" {
    pub fn GrB_Vector_apply_BinaryOp1st_UINT32(
        w: GrB_Vector,
        mask: GrB_Vector,
